{
    "Asics Gel Kayano 31": "Building upon the success from Kayano 30, Asics have tweaked the Kayano 31 with a few new features. This update introduces a new ASICSGrip outsole, delivering improved traction over Kayano 30 and a refined upper with an added pull tab to enhance ease of wear. The Kayano 31 continues to feature FF BLAS PLUS ECO foam and PureGEL technology in the midsole, for a smooth, cushioned and stable ride. The innovative 4D Guidance System Asics introduced in Kayano 30 has been rolled over into the Kayano 31, featuring a wide midsole surface area, medial convex geometry, lateral decoupling groove and guidance line which ensures a stable and supportive stride. The Kayano 31 is crafted for runners seeking a max-cushion, stability-focused daily trainer, perfect for easy and long runs. If youve enjoyed Kayano 30, youll feel at home in the 31. _________________________________________________________________________",
    "Kayano 30": "The Asics Gel-Kayano 30 has been completely redesigned from the ground up, offering a new level of comfort and stability. With the removal of the traditional medial post, Asics introduces the advanced 4D Guidance System for a smoother, more natural stride. The lightweight FF BLAST ECO foam and an increased stack height of 4mm deliver an even softer ride, while the rear-foot PureGEL enhances shock absorption for softer landings and smoother transitions. Ideal for runners who prioritise support and cushioning, this update delivers a fresh take on stability with a focus on long-lasting comfort. _________________________________________________________________________",
    "GT-4000 4": "The Asics GT-4000 4 is a really stable shoe in ASICS' running collection. Designed with a softer, smoother profile, it offers exceptional support and cushioning for a comfortable ride. The midsole features FF BLAST cushioning and PureGEL technology, delivering a cloud-like softness and energised toe-off. Additionally, LITETRUSS midsole technology enhances stability, ensuring a smoother, more balanced stride for every run. Plus, it's a great supportive option for walking, making it versatile for all-day wear. ________________________________________________________________________",
    "GT-2000 12": "The Asics GT-2000 12 is a lightweight stability daily trainer, offering a lower-stacked, firmer alternative to the Kayano 30. Its updated midsole features a full-length FF BLAST PLUS cushioning unit with added foam underfoot, paired with PureGEL technology in the rearfoot for a softer experience than previous versions of the GT-2000. The 3D GUIDANCE SYSTEM provides adaptive stability with a wider midsole surface area, cradled heel platform, and lateral guidance line, ensuring a smooth transition from footstrike to toe-off. _________________________________________________________________________",
    "GT-2000 13": "The Asics GT-2000 13 builds on the trusted stability features of its predecessor, the GT-2000 12, while introducing exciting updates for an even better run. Think of the GT-2000 13 as a lower stack version of the Kayano 31. This version features a new breathable engineered mesh upper that offers an improved fit, along with a handy heel pull tab for easy on and off. Enhanced with increased forefoot cushioning thanks to the FF BLAST PLUS foam, the GT-2000 13 delivers a smoother, more comfortable ride, making it perfect for runners seeking reliable support with added comfort. _________________________________________________________________________",
    "GT-1000 13": "The Asics GT-1000 13 is an entry-level stability daily trainer designed to offer reliable support and cushioning for your runs. Equipped with PureGEL technology and FLYTEFOAM cushioning in the midsole, it delivers a comfortable and responsive ride. The 3D GUIDANCE SYSTEM enhances stability, helping you maintain stability on the run. Ideal for runners and walkers seeking reliable performance and support. _________________________________________________________________________",
    "GEL-NIMBUS 26": "The Asics Gel-Nimbus 26 is a plush max-cushion, neutral daily trainer designed for easy, recovery and long runs. It features a forefoot rocker and a wide midsole surface area for a smooth, inherently stable ride. The midsole features FF BLAST PLUS ECO cushioning which delivers a lighter, softer experience with reduced environmental impact and the new Hybrid ASICSGRIP outsole enhances traction and durability over the Nimbus 25. A super comfortable, engineered knit upper wraps your foot, while the knit tongue and collar offer a soft, supportive feel. This shoe is perfect for runners who value comfort, stability, and sustainability. _________________________________________________________________________",
    "GEL-Cumulus 26": "The Gel-Cumulus 26 is a versatile, neutral daily trainer. Its lightweight Engineered Mesh upper offers a perfect balance of comfort, breathability, and fit without extra overlays. The FF BLAST PLUS midsole foam provides a lively, energetic ride, while the encapsulated PureGEL in the rearfoot enhances shock absorption and underfoot comfort. The FLUIDRIDE outsole ensures a soft landing and smooth transition, making every run a pleasure.",
    "GEL-Pulse 15": "Introducing the Gel-Pulse 15  your perfect entry-level running shoe. Whether you're gearing up for long runs, daily training, or hitting the gym, this neutral, cushioned shoe has got you covered. Crafted with engineered mesh, it enhances airflow to keep your feet cool and comfortable. The mesh also gently hugs your foot for a snug, cosy fit. Experience the ultimate comfort underfoot with FLYTEFOAM cushioning, complemented by internal GEL technology, offering a soft, supportive feel with every step. Step into the GEL-PULSE 15 and elevate your running experience.",
    "GEL-EXCITE 10": "Introducing the Gel-Excite 10  the perfect shoe to kickstart your fitness journey! This lightweight, cushioned shoe is ideal for beginner athletes and versatile enough for both running and daily workouts. The modern engineered jacquard mesh upper ensures your feet stay cool and comfortable, offering excellent breathability and a soft feel against your skin. With an increased midsole stack height, AMPLIFOAM+ cushioning, and GEL technology, the Gel-Excite 10 delivers softer landings and enhanced comfort. Plus, it's lighter than the previous model, helping you take each step with confidence. Lace up the GEL-EXCITE 10 and get ready to reach new fitness heights! _________________________________________________________________________",
    "SuperBlast 2": "The Superblast 2 is one of the most anticipated super trainers on the market. It's known for its lightweight comfort and versatile performance, this best-seller excels in everything from daily training and long runs to tempo work and even race day. The second edition features an updated design with a woven engineered mesh for a stretchier, more comfortable fit. Its midsole combines FF Turbo Plus foam (the same as in Metaspeed Paris race shoes) with a bottom layer of FF Blast Plus Eco to deliver a soft and responsive ride. The new AHARPLUS outsole enhances durability for reliable performance, and by filling in the midsole holes from Superblast 1, this new version won't collect debris and rocks. With its max cushioning and highly responsive feel, the ASICS Superblast 2 offers exceptional comfort without the need for a carbon plate, making it a go-to choice for long runs, easy runs, and marathon training. _________________________________________________________________________",
    "NOVABLAST 4": "Step into the Asics Novablast 4 for a bouncy, responsive ride thats perfect for long runs and daily training. This shoe features an innovative midsole and outsole geometry that gives the runner a versatile feel underfoot. The new tongue wing construction ensures a nice midfoot lockdown, while the engineered woven upper offers superior stretch, ventilation, and durability. With FF BLAST PLUS ECO cushioning made from 20% recycled bio-based content, you'll enjoy soft landings with a lighter environmental footprint. The updated trampoline outsole geometry enhances energetic toe-offs and grip, for a versatile ride. Plus, the NOVABLAST 4 features a wider midsole surface area than the previous iteration, which increases stability for a more confident run. ________________________________________________________________________",
    "METASPEED SKY PARIS": "The Asics Metaspeed Sky Paris is one of the lightest race shoes on the market, now 22 grams lighter than its previous version. Designed for chasing personal bests from the 5K all the way to the marathon, it features a PEBA based FF TURBO PLUS cushioning for a softer, bouncier ride. Asics have made a wider carbon fibre plate geometry which is positioned closer to the foot for enhanced propulsion and a new Motionwrap 2.0 upper for increased breathability and flexibility. Theres an updated ASICSGRIP outsole which ensures superior traction with reduced density and weight. Perfect for competitive runners looking to maximise performance and achieve their goals. _________________________________________________________________________",
    "METASPEED EDGE PARIS": "The Asics Metaspeed Edge Pars is one of the lightest race shoes on the market, now 25 grams lighter than its predecessor. Designed to help you chase personal bests from the 5K to the marathon, it features a PEBA based FF TURBO PLUS cushioning for a softer, bouncier ride. Asics have angled the carbon fibre plate with a spoon-shaped geometry for aggressive forward propulsion and higher leg turnover. The new Motionwrap 2.0 upper offers enhanced breathability and flexibility, while the updated ASICSGRIP outsole ensures superior traction with reduced density and weight. Perfect for competitive runners looking to maximise performance and achieve their goals. _________________________________________________________________________",
    "MAGICSPEED 4": "Meet Asics new training partner: the Magic Speed 4. Perfect for uptempo runs and race efforts, this shoe blends race-day performance with daily trainer durability. Its full-length carbon-TPU plate provides a firmer, responsive ride with smooth transitions, all while offering greater durability than the Metaspeed series. The updated version features a wider and thicker midsole with FF BLAST+ foam and a new FF TURBO forefoot insert, delivering superb responsiveness and energy return. A more relaxed ride than the Metaspeed series, the Magic Speed 4 is ready to support your every stride. _________________________________________________________________________",
    "NOOSA TRI 16": "Introducing the Noosa Tri 16 shoe  crafted to ignite your runs with an energetic toe-off and advanced energy savings. Vibrant colours and bold patterns meet a breathable engineered mesh upper, ensuring your feet stay cool and comfortable mile after mile. The midsole features FF BLAST PLUS cushioning, delivering lightweight and soft impact absorption for a smooth and effortless ride.",
    "Evoride Speed 2": "The Asics Evoride Speed 2 is a lightweight trainer that expertly bridges the gap between a daily trainer and a speed shoe. Ideal for tempo runs and long runs, this updated version focuses on delivering speed, comfort, and a better fit, offering more energy savings than its predecessor. Featuring a forefoot rocker, it promotes a smooth, efficient toe-off for faster strides. FF BLAST cushioning provides softer landings and a responsive rebound. The durable AHAR rubber outsole ensures improved durability across various surfaces, making the Evoride Speed 2 a versatile option for faster miles.",
    "Hyper Speed 4": "The Asics Hyper Speed 4 is designed for those who appreciate the feel of a classic, old-school racer. This lightweight shoe delivers a nimble, responsive ride with a streamlined, no-frills approach, making it perfect for speedwork and race day. Its minimalist design ensures a close-to-the-ground experience, providing the agility and precision of traditional racing shoes while still offering modern performance features. Ideal for runners who value simplicity and speed, the Hyper Speed 4 blends vintage racer vibes with contemporary efficiency.",
    "Glideride Max": "The Asics Glideride Max, the update to the Glideride 3, is a daily trainer crafted for long and recovery runs, ideal for runners seeking some forefoot stiffness. It features a dual midsole setup with FF BLAST MAX on the top layer and FF BLAST PLUS ECO on the bottom layer, to create a soft and stable ride. The GUIDESOLE technology is enhanced with a Hardened Press EVA Plate sitting between the two midsole foams for added stiffness, delivering a smooth, efficient rocker from heel to toe. The outsole blends ASICSGRIP technology, as seen on the Nimbus 26 and Kayano 31, with AHARPLUS at the heel for superior traction and durability.",
    "Glideride 3": "Discover the Asics Glideride 3, crafted for runners who crave a responsive forefoot and energy-saving efficiency on long, recovery runs. This new version is all about smooth, comfortable strides with a redesigned engineered mesh upper thats softer and more breathable than ever. Asics feature FLYTEFOAM technology in the midsole, offering a plush landing, while the FF BLAST PLUS top layer provides a lively bounce back. The GUIDESOLE technology combines an increased toe spring, a firmer forefoot, and a Guidance Line for a smooth transition from heel to toe. _________________________________________________________________________",
    "Metafuji Trail": "The Asics Metafuji Trail is built for speed, protection, and performance on the toughest trails. Designed with ASICS' top technologies, this shoe delivers a smoother, softer, and faster running experience, ideal for ultra-distance athletes.  Featuring FF TURBO (midsole from Superblast 1) and FF BLAST PLUS midsole foams, the Metafuji Trail offers lightweight, responsive cushioning that absorbs impact and returns energy with every stride. A full-length carbon plate with unique geometry enhances speed and propulsion so you can push the pace on the trails.  With a 44mm stack height of premium cushioning, a breathable mesh upper made with at least 50% recycled materials, and reflective details for low-light visibility, the Metafuji Trail offers comfort, protection, and visibility. The ASICSGRIP outsole also provides reliable traction on varied terrain, making this shoe your go-to for any trail race.",
    "GT 2000 13 TR": "The Asics GT-2000 13 TR takes the trusted comfort and stability of the GT-2000 13 and enhances it for offroad adventures. Featuring an updated outsole designed specifically for trail running, this shoe provides superior grip and traction on uneven off road terrain while maintaining the smooth, stable ride you've come to expect. Whether you're hitting the trails or running on mixed surfaces, the GT-2000 13 TR offers reliable performance with its cushioned midsole, supportive structure, and durable design, making it a versatile choice for runners who crave both road and trail experiences. _________________________________________________________________________",
    "NOVABLAST 4 TR": "Inspired by the popular Novablast 4, the Asics Novablast 4 TR brings trail-specific enhancements for off-road running. While retaining the Novablast 4's signature FlyteFoam Blast+ midsole for exceptional cushioning and energy return, the Novablast 4 TR features a rugged trail outsole designed to tackle diverse terrains. This updated model includes aggressive multi-directional lugs for superior grip and stability on uneven surfaces.The breathable mesh upper, reinforced with durable overlays, provides a secure fit and protection against debris. Perfect for transitioning from road to trail, the Novablast 4 TR offers the versatility and performance needed for all your off-road adventures. _________________________________________________________________________",
    "GEL NIMBUS 26 TR NB": "Elevate your trail running with the Asics Nimbus 26 TR, a trail-ready evolution of the beloved Nimbus 26. This shoe builds on the renowned comfort of the Nimbus 26, featuring the same FF Blast Plus midsole for superior cushioning and energy return. The Nimbus 26 TR is enhanced with a newly designed outsole, specifically engineered to tackle off-road terrain. The aggressive, multi-directional lugs provide exceptional grip and stability on rugged surfaces, ensuring you stay confident on varied trails. With a reinforced, breathable mesh upper that protects against trail debris while offering a secure fit, the Nimbus 26 TR combines the plush comfort of the Nimbus 26 with trail-specific functionality. Perfect for transitioning between road and trail, this shoe is designed to deliver performance and comfort across diverse terrains. _________________________________________________________________________",
    "TRABUCO 12 GTX": "Introducing the Gel-Trabuco 12 GTX shoe  the perfect companion for trail runners seeking superior traction and protection on technical off-road terrain. With a GORE-TEX membrane, this shoe keeps your feet warm and dry even in wet conditions. The engineered mesh upper is softer and more breathable, enhanced with a no-sew print design for added support. The GTX material ensures extra protection from the elements, and the lace garage feature allows you to tuck away your laces neatly with a bungee lace keeper solution. Experience ultimate comfort with the midsole design, which utilises FF BLAST cushioning and GEL technology in the rearfoot for improved impact absorption. The full ground contact outsole design, featuring a wider base net and 3D SPACE CONSTRUCTION technology, provides a stable ride on varying terrain. The updated rock protection plate at the forefoot offers flexible construction to shield your feet from sharp rocks and rugged terrain.",
    "Trabuco Max 3": "The Trabuco Max 3 shoe is your perfect companion for navigating the trails with ease. Ideal for trail runners seeking maximum protection and cushioning, this shoe is designed to perform on any trail, no matter the distance or surface. The upper features a high-performance trail mesh with durable ripstop overlays, providing added protection and breathability. The updated lace garage system keeps your laces neatly tucked away, so you can focus on your run without distractions. With FF BLAST PLUS technology in the midsole, you'll experience effortless impact absorption and a dynamic, lightweight feel that propels you forward with every step. GUIDESOLE forefoot rocker technology enhances this forward momentum, helping you run further while using less energy. For ultimate grip on off-road terrain, the ASICSGRIP outsole rubber ensures you stay sure-footed, no matter where the trail takes you.",
    "Gel Trabuco 12": "The Gel-Trabuco 12 shoe is your go-to trail companion, perfect for runners seeking superior traction and protection on challenging off-road terrain.  Designed with an engineered mesh upper, this shoe offers a softer, more breathable fit, enhanced by a no-sew print design for added support. The lace garage feature, combined with a bungee lace keeper, ensures your laces stay securely tucked away so you can focus on the trail ahead.  For unmatched comfort and impact absorption, the midsole incorporates FF BLAST cushioning and GEL technology in the rearfoot. The full ground contact outsole, with a wider base and 3D SPACE CONSTRUCTION technology, provides a stable ride on varying terrains. Plus, the updated rock protection plate in the forefoot flexibly shields your feet from sharp rocks and rugged surfaces.  The outsole is equipped with revamped ASICSGRIP technology, delivering enhanced traction to keep you sure-footed on any trail.",
    "Trabuco Terra 2": "The Trabuco Terra 2 is the perfect trail shoe for beginner runners ready to tackle challenging off-road terrain with confidence. It offers a harmonious blend of comfort and protection, making your trail adventures more enjoyable.  The multi-directional engineered mesh upper adapts seamlessly to your foots natural movement while maintaining the essential midfoot support needed for trail running.  With FF BLAST midsole cushioning, youll experience softer landings and a more energised bounce back with each step. The outsoles tread pattern is designed to deliver superior traction, keeping you steady on a variety of trails.",
    "Fuji Lite 4": "The Fuji Lite 4 is the ideal lightweight trail shoe for intermediate to experienced runners seeking high performance on the trails.  Equipped with FF BLAST midsole cushioning, it delivers exceptional comfort and protection across varied terrain. The redesigned outsole is lighter and offers enhanced grip, giving you better traction on uneven surfaces, even in wet conditions.  The uppers mesh material is thoughtfully crafted with fewer resources and more recycled components, reflecting a commitment to sustainable manufacturing.",
    "Gel Sonoma 7 GTX": "The Gel-Sonoma 7 7 is your entry level trail shoe for durability and reliable grip, perfect for recreational runners who love exploring off-road paths. The GTX version is formed with a GORE-TEX membrane that helps keep your feet warm and dry when you're running in wet conditions.  Enjoy exceptional underfoot comfort with the full-length AMPLIFOAM midsole and strategically placed GEL technology, offering cushioning exactly where you need it most.  The trail-specific outsole is designed for advanced traction, giving you the confidence to tackle both uphill and downhill sections of challenging terrain with ease.",
    "Gel Sonoma 7": "The Gel-Sonoma 7 is your entry level trail shoe for durability and reliable grip, perfect for recreational runners who love exploring off-road paths.  Enjoy exceptional underfoot comfort with the full-length AMPLIFOAM midsole and strategically placed GEL technology, offering cushioning exactly where you need it most.  The trail-specific outsole is designed for advanced traction, giving you the confidence to tackle both uphill and downhill sections of challenging terrain with ease.",
    "Metaspeed MD": "The Metaspeed MD spike is designed for elite middle-distance track athletes who want to take longer strides with less effort, perfect for races from 400 to 1500 metres. The thicker heel provides added stability, keeping you steady as you push your limits.  Featuring FF BLAST TURBO cushioning, this spike delivers a responsive rebound at toe-off, while the integrated carbon plate propels you forward with an extended stride length.  The outsoles moulded spike configuration is engineered for maximum traction, offering advanced grip without adding unnecessary resistance on the track, so you can focus on reaching your peak performance.",
    "Metaspeed SP": "The Metapseed SP spike is perfect for competitive sprinters, designed for athletes who excel in sprint distances from 100m to 400m.  Engineered with advanced midsole and outsole technologies, this spike helps you take longer strides with less effort, pushing you to achieve your best.  Crafted with our premium FF BLAST TURBO midsole foam, it delivers an incredibly lightweight and responsive rebound, while the integrated carbon plate propels you forward with powerful speed.  The outsoles moulded spike configuration enhances traction, providing advanced grip without adding resistance, so you can focus on reaching peak performance on the track.",
    "Hyper Sprint 8": "The Hypersprint 8 is your go-to entry level track shoe, whether you're just starting out or an experienced sprinter.  Its synthetic and mesh upper provides a lightweight, breathable fit, while the no-sew film ensures the shoe remains supportive and durable.  Designed with a resin plate for enhanced propulsion and grip, and featuring 5 pyramid spikes, this shoe delivers exceptional performance for high-speed sprints without slipping. The EVA sockliner adds flexibility and extra support exactly where you need it, making every stride count.",
    "Hyer MD 8": "The Hyper MD 8 is the perfect entry level track spike for beginner to intermediate middle-distance runners, covering distances from 400 to 3000 metres.  With its lightweight design and breathable mesh structure, this shoe keeps your feet cool and comfortable. The no-sew film in the upper adds extra reinforcement and ensures a snug, supportive fit.  Enjoy the cushioning support of the EVA midsole foam, while the nylon plate and five pyramid spikes enhance propulsion and grip, helping you perform your best on the track.",
    "Hyper LD 6": "The Hyper LD 6 is your ideal track spike for beginner to intermediate long-distance runners tackling distances over 5000m.  Designed with a lightweight feel and a breathable mesh upper, this shoe ensures excellent ventilation and comfort. The no-sew films add extra reinforcement for a snug, secure fit.  Featuring a full EVA midsole foam, the Hyper LD 6 offers supportive cushioning underfoot for a smooth run.  The nylon outsole plate is equipped with five removable metal pyramid pins and a rubber heel, delivering reliable traction and grip on the track.",
    "Gel Firestorm 5": "The Gel-Firestorm 5 is the perfect track & field shoe for kids, offering both protection for growing feet and fun graphics they'll love.  Featuring durable synthetic leather and a full graphic print, this shoe is designed to be as playful as it is practical. With its cushy EVA sockliner, it provides a comfy fit, making it a great choice for your little athlete.",
    "GT-2000 SX": "The GT-2000 SX walking shoe is your ideal partner for active walks, offering a perfect mix of support, comfort, and durability.  Its solid rubber outsole and reinforced polyurethane-coated mesh upper ensure long-lasting wear, so you can walk confidently on any terrain.  With a FLYTEFOAM midsole and GEL cushioning in both the rearfoot and forefoot, you'll enjoy a plush, cushioned feel with every step.  DYNAMIC DUOMAX support technology and a TPU TRUSSTIC in the midfoot provide excellent stability, making each walk comfortable and secure.",
    "Walkride FF": "The Walkride FF is your perfect companion for walking, crafted to help you conserve energy and enhance your forward motion with ease.  Featuring a PU-coated mesh upper, this shoe combines durability with breathability, offering excellent protection and a comfortable fit.  FLYTEFOAM cushioning in the midsole keeps the shoe lightweight and plush, while GUIDESOLE technology ensures a smooth, effortless roll with every step.  The outsole is made from high-density rubber, providing extra durability to stand up to the demands of your walks, so you can focus on enjoying your journey.",
    "Gel-550 TR": "The GEL-550TR is your versatile training and walking shoe, offering both stability and durability to keep you going strong.  With DUOMAX support, this shoe is perfect for varied training routines and side-to-side movements, providing dependable stability along with enhanced forefoot flexibility and responsiveness.  The forefoot and rearfoot GEL technology ensure excellent shock absorption, while the thoughtfully designed upper delivers supreme comfort and a perfect fit. Whether youre training hard or enjoying a walk, the GEL-550TR has you covered.",
    "GT-1000 LE 2": "The GT-1000 Leather 2 is your go-to for a stable and supportive walking shoe, crafted to provide energised cushioning and reliable stability for every step you take. Designed with a wide fit to accommodate those with broader feet, it ensures comfort and support for all.  Featuring rearfoot GEL technology and FLYTEFOAM cushioning, this shoe keeps your feet cushioned and comfortable throughout your walk.  The DUOMAX support system enhances stability through each stride, helping you stay steady and confident with every step.",
    "Gel-Trigger 12": "The Gel-Trigger 12 shoe is your versatile companion for a range of training activities, from running to low-intensity turf sports.  Its upper features a combination of quilted leather and synthetic overlays with breathable mesh, ensuring your feet stay comfortable throughout your workout.  With GEL technology in the midsole, youll enjoy superior impact absorption, while the strategically designed outsole tread offers excellent grip on turf surfaces, keeping you steady and focused.",
    "Kayano 31 GS": "The Gel-Kayano 31 GS (Grade School) shoe is designed to give young feet a stable and ultra-comfortable experience.  Weve enhanced the midsole with FF BLAST PLUS ECO cushioning, which is made with approximately 24% bio-based content. This means every step feels cloud-soft, perfect for active kids.  To top it off, the shoe features toe-rubber stitching and a medial forefoot wrap-up outsole, adding extra durability for all their adventures.",
    "GT-2000 12 GS": "Introducing the GT-2000 12 GS (Grade School) shoe a versatile and supportive trainer designed to keep up with every step your child takes, no matter the distance. We've enhanced the underfoot cushioning, so it feels even more comfortable and full of energy with every stride.  To ensure the perfect fit, our kid-specific size checker makes sizing easy. Plus, the wrap-up outsole and reinforced toe rubber stitching add extra durability for all their adventures.  The innovative 3D GUIDANCE SYSTEM offers holistic foot support, combining midsole geometry and a wider basenet to keep their stride steady and balanced.  And with advanced FLYTEFOAM and encapsulated rearfoot GEL technologies, your child will enjoy soft, cloud-like cushioning that adds a spring to their step and energises every take-off.",
    "Cumulus 26 GS": "The Gel-Cumulus 26 GS (Grade School) shoe is a perfect everyday trainer for young, active feet. With its neutral support and versatile style, it's ready to keep up with all their adventures. Plus, the engineered mesh upper adds a cool, breathable feel for all-day comfort.",
    "Novablast 4 GS": "Introducing the Novablast 4 GS, the kid-friendly version of the beloved Novablast series! This shoe is crafted with a new midsole and outsole design that delivers a springy, high-energy running experience, perfect for active kids. Built on a last specifically designed for growing feet, it ensures a comfortable and supportive fit.  Asics have added thoughtful details like a reinforced toe rubber stitch, an outsole phrase, and a wrap-up design that offer extra stretch and durability. Plus, it's designed to enhance propulsion, helping your young athlete run with ease and confidence.",
    "GT-1000 13 GS & PS": "Introducing the GT-1000 13 shoe  the perfect all-rounder for kids on the move! Whether they're running a quick sprint or going the distance, this stability trainer is built to support every step. We've added extra cushioning underfoot, making each stride feel more comfortable and full of energy.  Designed with growing feet in mind, the shoe features a kid-specific fit and a handy sockliner size checker. Plus, the durable medial forefoot wrap-up outsole and reinforced toe ensure these shoes can keep up with any adventure.  The signature GEL technology provides plush comfort all day long.",
    "Noosa TRI 16 GS & PS": "Inspired by our top-performing triathlon shoe, the Pre Noosa Tri 16 PS brings the same vibrant energy and innovative design to a new level. With its bold colour blocking and technical features, this shoe is built to stand out.  The mesh upper enhances breathability, keeping feet cool and comfortable, while the eye-catching colorway and bold \"Noosa\" graphics add a fun, energetic touch.  Designed with comfort in mind, this shoe features an injection EVA midsole for cushioned support and increased flexibility in the forefoot for a more natural feel. Plus, the durable toe stitching and rubber outsole ensure long-lasting wear, so your little one can keep moving in style.",
    "Excite 10 GS & PS": "Step into comfort and style with the Gel-Excite 10, the perfect cushioned shoe for active kids! Designed with vibrant, energised details, this shoe offers breathable comfort, thanks to its lightweight upper that helps prevent irritation in the forefoot. Plus, with durable features like toe rubber stitching and a solid rubber outsole, this shoe is built to keep up with every adventure and last through all their active days.",
    "Contend 9 GS & PS": "The Contend 9 GS shoe is crafted with young feet in mind.  With features like toe reinforcement, toe rubber stitching, and a solid rubber outsole, these shoes are built to last and keep up with every adventure.",
    "Gel Venture 9 GS & PS": "The Gel-Venture 9 GS shoe is crafted to keep young, active feet comfortable and well-cushioned, with specially designed outsole lugs for great traction on all kinds of surfaces.",
    "Gel-550 TR GS & PS": "Discover the GEL-550 TR active training shoe, designed to be the perfect companion for young athletes. A favourite in Australia for school sports, this shoe stands out with its exceptional durability and protective features. It boasts a cushioned midsole paired with a supportive upper, while DUOMAX technology ensures stability and GEL technology enhances cushioning for ultimate comfort. Ideal for energetic kids who need a shoe that can keep up with their active lifestyle!",
    "Supernova Prima": "Discover the adidas Supernova Prima running shoes, crafted to elevate your running experience with comfort and support. Enjoy the plush, lightweight Dreamstrike+ cushioning that softens every stride, paired with the precision-engineered Support Rod system for smooth transitions and added forefoot stability. The innovative Lighttraxion outsole offers superior grip without the extra weight, while the engineered mesh upper keeps your feet cool and breathable.  Perfect for runners who crave extra comfort and support on their runs, the Supernova Prima is also a step towards sustainability. With at least 20% of the materials being recycled or renewable, these shoes help reduce waste and conserve resources. Run in comfort, and a touch of eco-consciousness.",
    "Adizero Boston 12": "Experience race-day speed in your training with the Adidas Adizero Boston 12. Designed to bring a propulsive, race-like feel to your daily runs, the Boston offers a perfect balance of speed, comfort, and durability.  The Boston 12 features the innovative ENERGYRODS 2.0 technology, infused with glass fibres to limit energy loss underfoot and enhance propulsion. Paired with the LIGHTSTRIKE PRO cushioning and robust Lightstrike 2.0 EVA in the midsole, this shoe delivers a smooth, dynamic ride that feels fast and responsive.  Engineered for targeted support, the Boston 12 provides reinforced midfoot lockdown ensuring a secure fit. The Continental outsole offers industry-leading grip, making it reliable in even the most demanding conditions. Whether you're training for your next race or looking for a versatile daily trainer, the Adidas Adizero Boston 12 is a great option.",
    "Adizero SL2": "The Adidas Adizero SL2 running shoes are designed to keep up with your speed, featuring responsive Lightstrike Pro cushioning that offers a bounce in every step. The engineered mesh upper ensures breathability and provides targeted support, so you can keep soaring toward the finish line.  Feel good knowing that these shoes include at least 20% recycled materials. By repurposing existing materials, were reducing waste and minimising our environmental impact, all while helping you run faster and more sustainably.",
    "Adizero Adios Pro 3": "Discover the Adizero Adios Pro 3 the ultimate in Adidas distance racing shoes, crafted to help you set new personal bests. Designed in partnership with athletes, Adidas have engineered the Adios Pro 3 to be efficient, featuring carbon-infused ENERGYRODS 2.0 for a responsive, fast ride. The Pro 3 features a full length slab of Adidass most propulsive LIGHTSTRIKE PRO foam to provide cushion and bounce to each stride. Plus, the textile Continental outsole offers best in class grip and durability, whether you're running in wet or dry conditions.",
    "Prime X 2 strung": "Discover the Prime X 2 Strung, the super trainer and race shoe that's designed to elevate your performance. With cutting-edge technology and no limits from world race regulations, this shoe brings together a host of advanced features in one sleek package. The STRUNG upper, a breakthrough textile innovation, adapts to your unique needs for a custom fit. Underfoot, youll find 50mm of LIGHTSTRIKE PRO foam, including a new energy core that lightens the load while adding a springy feel to your stride. Plus, the Continental outsole provides exceptional grip on any surface, helping you push towards your fastest time yet.",
    "Takumi Sen 10": "Achieve your best 10K time with our newest Adizero racing shoes, engineered specifically for speed. The Adizero Takumi Sen 10 features dual layers of LIGHTSTRIKE PRO cushioning for superior responsiveness and comfort. Additionally, ENERGYRODS provide a stiff, propulsive feel for efficient transitions from corners to straights. These advanced features are designed to help you reach the finish line in record time.",
    "Prime SP 3": "The Adizero Prime SP 3 running spikes are designed with a full-length spike plate and responsive Lightstrike Pro cushioning in the forefoot to help you sprint past your limits. The STRUNG upper, crafted yarn-by-yarn, wraps your feet in a snug, seamless fit.  Plus, this product features at least 20% recycled materials. By reusing existing materials, were cutting down on waste and conserving valuable resources, making each step you take more eco-friendly.",
    "Adizero Finesse": "Want to shave seconds off your personal best? The Adizero Finesse track spikes from adidas are here to help! With ultralight Lightstrike cushioning, youll experience unmatched speed from the moment you take off. The featherlight upper gives you a barely-there feel, and the full-length spike plate ensures perfect grip as you speed around the track.",
    "Adizero Ambition": "Discover the thrill of the track with our middle-distance spikes, crafted with a touch of sustainability. Perfect for races from 800 to 1500 metres, these adidas running shoes are designed to help you achieve your fastest pace. Experience the freedom of a woven mesh that feels almost weightless and the explosive speed provided by a synthetic spikeplate outsole combined with LIGHTSTRIKE PRO cushioning. Plus, this product features at least 20% recycled materials. By reusing existing materials, were cutting down on waste and conserving valuable resources, making each step you take more eco-friendly.",
    "Adizero Avanti": "Get ready to elevate your running experience! These track shoes, designed for distances from 3K to 10K, are crafted with a focus on both performance and sustainability. The glass fibre-infused outsole plate delivers an energy-efficient boost, while Lightstrike Pro cushioning provides superlight comfort and energy return for that extra edge. The breathable mesh upper ensures you stay cool and comfortable from the starting line to the finish.  Plus, this product features at least 20% recycled materials. By reusing existing materials, were cutting down on waste and conserving valuable resources, making each step you take more eco-friendly.",
    "Adizero TJ/PV": "Discover the perfect blend of speed, power, and sustainability with the adidas triple jump and pole vault spikes. Crafted with recycled materials, these spikes are designed to elevate your performance and make a positive impact on the planet. Feel the light, stable comfort and responsive Lightstrike Pro cushioning that will propel you to the podium. The spike outsole ensures confident traction as you accelerate and take off.  With an upper made from at least 50% recycled content, these spikes are a step towards reducing plastic waste.",
    "Sprintstar": "Discover your ultimate speed with the Adizero Sprintstar shoes, crafted with a touch of sustainability. These track spikes are designed for those who aim to break their personal best on the track. Featuring a synthetic upper and breathable mesh lining, they offer a snug fit and a rigid spike plate that maximises your speed on the track. Feel confident with every push-off, as the aerodynamic design and synthetic sole propel you forward with every stride.  Plus, this product features at least 20% recycled materials. By reusing existing materials, were cutting down on waste and conserving valuable resources, making each step you take more eco-friendly.",
    "DistanceStar": "Introducing the Adidas Adizero Distancestar shoes a perfect blend of speed and performance in a lightweight, entry-level package. Designed with distance track running in mind, these shoes are incredibly versatile and ready to tackle sprints, jumps, and hurdles with ease.  The breathable synthetic upper ensures you stay comfortable whether you're sprinting or running multiple laps, while the spike plate delivers exceptional forward propulsion. The thin EVA midsole cushioning provides a smooth stride, helping you move effortlessly.  Plus, this product features at least 20% recycled materials. By reusing existing materials, were cutting down on waste and conserving valuable resources, making each step you take more eco-friendly.",
    "Throwstar": "Get ready to elevate your game with the Adidas Throwstar throwing shoes! Crafted with a touch of recycled materials and designed for a lightweight feel, these shoes are here to boost your energy and performance.  Designed for shot put, discus, and hammer throw, the Throwstar shoes offer a fantastic combination of comfort and traction. Theyre your perfect partner to help you reach new heights in your field events.",
    "Allrounder - Kids": "The Adidas Allroundstar Junior, designed for the young athletes to offer a mix of durability, comfort, and performance, making them a top choice for aspiring track and field stars.  Versatile enough for sprints, long jumps, and various track events, the Allroundstar Junior shoes are designed to support and enhance every young athletes performance.",
    "VIA Olympus 2": "Discover the new VIA Olympus 2, where Altras iconic fit meets maximum cushioning. With its softer Altra EGO MAX midsole foam, this shoe offers the same generous stack height from version 1, but with a lighter, more cushioned feel. The rocker shape geometry supports an efficient toe-off, while the refined moulded heel collar provides a snug, secure fit. Ample room for your toes and a zero drop design ensure Altras signature natural fit, allowing you to move effortlessly and comfortably. Designed to maximise comfort, its perfect for long periods on your feet whether that's running or walking.",
    "Torin 7": "Altra have reimagined the Torin 7 to bring you ultimate comfort and performance. An additional 2 millimetres of soft Altra EGO MAX foam to the midsole, giving you that extra bounce with every step. The redesigned tongue ensures a plush, cosy fit, while the new engineered mesh upper keeps you cool and comfortable, wherever your run takes you. The updated moulded heel collar hugs your foot securely, providing a perfect fit with every stride. With balanced cushioning and an Altra Standard FootShape Fit, the Torin 7 adapts to your natural movement, making it the perfect companion for any run, any road, and any distance.",
    "Escalante 4": "Escalante 4 is lighter, more flexible, and still has that FootShape fit you adore. Whether youre hitting the pavement for a speedy run, working out in the gym, strolling through your daily routine, or running errands, this shoe is your new go-to for every road mile. A redesigned knit upper that hugs your foot like a sock, and a knit tongue for that classic Escalante feel. There's an enhanced rubber midsole to be lighter and more flexible. You'll stay connected to the road while enjoying the familiar comfort of our Altra EGO foam. The roomy toe box and zero drop can allow your feet to move naturally and freely.",
    "Escalante Racer 2": "Get ready to experience the Escalante like never before faster, lighter, and even more responsive. Altra have taken everything you love about the Escalante and made it faster. Perfect for a minimalist feel on speed workouts, or fast training runs, this shoe is designed to help you smash personal records and conquer new segments. The updated engineered knit upper offers a comfy, breathable fit, while the Altra EGO midsole foam provides a perfect balance of responsiveness and a touch of firmness for a direct connection to the ground. Keeping all the features you love from the classic Racer: a low 22mm stack height for quick turnover, a roomy toe box, and zero drop for natural movement. The Escalante Racer 2 is all about delivering pure, unfiltered performance.",
    "Experience Flow": "Introducing the Experience Flow (formerly the AltraFWD Experience), which is all about a smooth, effortless, and efficient ride. With its refreshed two-colour engineered mesh for enhanced breathability, a 4mm drop that pairs perfectly with the shoes rocker shape geometry for a seamless toe-off, and a lightweight, responsive midsole foam for daily training performance, the Experience Flow is designed to support you every step of the way. Featuring Altras signature FootShape fit, youll enjoy a roomy toe box and a secure midfoot, allowing a natural forefoot splay. A great entry into the Altra range of shoes for runners keen to try Altra, but have been apprehensive of their typical zero drop.",
    "Olympus 6": "Take on the trails and all day adventures with Altras plushest trail running shoe yet. Enjoy unbeatable comfort with a soft, cushioned feel and a roomier toe box that lets your toes splay. Altra have kept the cushioned and responsive midsole foam and enhanced the mesh upper for even better breathability, perfect for those long trail days. The Vibram Megagrip outsole with its updated lug pattern offers outstanding grip, stability, and durability, for reliable traction on varied terrain. Plus, Altra have added a premium Achilles pillow for a luxuriously comfortable step-in experience. With the Original FootShape Fit, your feet have plenty of room to move naturally, from the toe box to the midfoot.",
    "Olympus 5": "Get ready to explore with the Olympus 5, a trail running shoe designed for every adventure. Enjoy plush cushioning that keeps your feet comfortable and protected, while the Original FootShape Fit allows them to move naturally. With a breathable mesh upper and a grippy outsole, you'll stay comfortable and confident on any terrain.",
    "Lone Peak 8": "The Lone Peak 8 is back and ready for your next big adventure and is built for more trails, and memories. With a refined ripstop mesh upper for extra durability and a MaxTrac outsole for the grip you need to tackle any terrain, you're set to explore with confidence. The Lone Peak 8 also offers a roomy toe box and zero drop, allowing your feet to move naturally. Plus, with the responsive yet comfy Altra EGO midsole foam, you'll be ready for anything whether it's thru-hiking, exploring, or trail running.",
    "Lone Peak 7": "Altras top-selling trail shoe has been revamped with a seamless, stitch-less upper thats both lightweight and durable. Enjoy the freedom of a streamlined design that keeps you nimble and confident on any terrain. With the enhanced MaxTrac outsole for unbeatable grip and the Altra EGO midsole offering the perfect blend of responsiveness and comfort, your feet will move naturally through every adventure.",
    "Experience Wild": "The Experience Wild is crafted to be super lightweight and grippy, perfect for those rolling terrains or speedy runs. Thanks to its responsive, compression-moulded midsole foam you get a nice element of cushioning but still feel connected to the trails. The MaxTrac outsole provides grip, traction, and durability, giving you the confidence to tackle any trail. Keep your feet clean and comfortable with the GaiterTrap feature for easy attachment of Trail Gaiters and no-sew overlays that protect your toes. The low 4mm drop and rocker shape geometry ensure a smooth, efficient roll with every step. Plus, with Altras signature FootShape fit, your toes get the space they need while your midfoot stays secure.",
    "Ghost Max 2": "Experience the ultimate Brooks comfort and protection with the Ghost Max 2. Featuring a high-stacked, nitrogen-infused DNA LOFT v3 midsole, this shoe delivers just the right amount of softness for cushioned landings. The GlideRoll Rocker gently guides your foot from heel to toe, making transitions smooth and effortless. With the broad midsole base and uniquely shaped geometry, the Ghost Max 2 offers an inherently stable and a protective feel, helping to reduce underfoot pressure and lessen the impact on your body. The generous fit and ease of orthotic use remains a feature in this new interaction and the new RoadTack outsole will improve durability over the original Ghost Max.",
    "Glycerin 21": "Experience unmatched comfort with the Brooks Glycerin 21, one of the most popular high-mileage neutral shoes sold in-store. Engineered for runners who demand the best in cushioning, this model now features an additional 2 mm of DNA LOFT v3 midsole cushioning, providing soft shock absorption for every step. Whether you're logging miles or enjoying a casual walk, the Glycerin 21 delivers lightweight comfort that handles any distance with ease. The hard-wearing RoadTack rubber outsole offers excellent traction and durability, while the broad platform ensures smooth stability, elevating your running experience. Plus, this shoe works seamlessly with orthotics, making it a great choice for those utilising an insole. Whether you're looking for a reliable training companion or all-day comfort, the Glycerin 21 has you covered.",
    "Ghost 16": "Introducing the Brooks Ghost 16  now featuring Brooks softest DNA LOFT v3 nitrogen-infused cushioning for a balanced, but responsive ride. A durable, reliable and traditional feeling midsole set up makes the Ghost suited to daily training and walking. With a secure fit, breathable upper, and impact-absorbing foam underfoot, the Ghost 16 is designed for a distraction-free experience. Plus, its certified Carbon Neutral, so you can feel good about every step.",
    "Glycerin GTS 21": "Experience unmatched comfort with the Brooks Glycerin 21, now with an extra 2 mm of DNA LOFT v3 midsole cushioning for cloud-soft shock absorption. Whether you're running or walking, this lightweight comfort handles any distance, allowing you to enjoy every step. The GTS 21 also features the adaptable GuideRails support technology to provide additional stability for every run and walk. The hard-wearing, weight-saving RoadTack rubber outsole provides excellent traction and durability. Plus, the broad platform offers smooth stability to elevate your running experience to new levels.",
    "Adrenaline GTS 23": "Step into comfort and confidence with the Adrenaline GTS 23. Designed for the perfect balance of stability and softness, this shoe features our latest GuideRails support technology. Brooks most popular support shoe now boasts an even better midsole, thanks to the lighter DNA LOFT v2 cushioning. Whether you're hitting the pavement or just getting started, this shoe is ready to go the distance with you.",
    "Hyperion Elite 4": "Elevate your race day performance with shoes crafted by athletes for next-level speed. Featuring DNA FLASH v2 cushioning, which is lighter and delivers nearly 10% more energy return than before, these shoes absorb impact to keep your legs feeling fresh from start to finish. The SpeedVault Race+ Plate, made using Additive Moulding with bio-based materials for near-zero waste, offers fine-tuned propulsion, while the RapidRoll Rocker curved sculpting of the midsole works with the carbon fibre plate to propel you forward. Available in unisex sizing, just pick your usual size for men. Women, for the perfect fit, we recommend ordering 1.5 sizes down from your usual size.",
    "Hyperion Max 2": "Take your running to the next level with the men's Brooks Hyperion Max 2. Designed for speed and comfort, this shoe features a lightweight nitrogen-infused DNA FLASH v2 midsole foam that offers a perfect balance of responsiveness and protection. The RapidRoll Rocker-shaped midsole, paired with a SpeedVault Plate, ensures smooth transitions and a quicker turnover, helping you push your pace with confidence.",
    "Hyperion 2": "Take your speed session to the next level with the Brooks Hyperion 2! Featuring a lower stack, lightweight, nitrogen-infused DNA FLASH v2 foam to deliver a lively, responsive feel designed for faster training efforts. With an additional 4 mm of stack, you'll enjoy extra protection and even more bounce compared to the previous version. The outsole boasts RoadTack Rubber, providing durable traction and added rebound for a more dynamic run. Plus, the lightweight, breathable upper ensures your feet stay securely locked in, offering a distraction-free fit as you tackle tight turns.",
    "Caldera 7": "The Caldera 7 trail-running shoe is your perfect companion for long-distance journeys. With its premium cushioning and a dynamic, durable design, this shoe promises a stable ride on any terrain. Enjoy the plush comfort of the soft nitrogen-infused DNA LOFT v3 cushioning, while the wide base and updated midsole sidewalls provide extra stability and security to handle the trails with confidence and comfort!",
    "Cascadia 18": "Experience the perfect blend of adaptable stability and trail-ready protection with the mens Brooks Cascadia 18. This trail running shoe is designed to handle even the toughest terrain with ease. Thanks to the innovative Trail Adapt System, which combines a supportive midsole, rock shield, and specialised outsole pods, youll enjoy improved control and stability on every trail. The DNA LOFT v2 cushioning reduces impact on your feet, while maintaining a connected feel and the TrailTack Green outsole rubber ensures reliable traction on both wet and dry surfaces.",
    "Cascadia 18 GTX": "Experience the perfect blend of adaptable stability and trail-ready protection with the mens Brooks Cascadia 18. This trail running shoe is designed to handle even the toughest terrain with ease. The GTX upper offers waterproof protection, keeping your feet dry in wet conditions. Thanks to the innovative Trail Adapt System, which combines a supportive midsole, rock shield, and specialised outsole pods, youll enjoy improved control and stability on every trail. The soft cushioning of DNA LOFT v2 reduces impact on your feet, while the TrailTack Green outsole rubber ensures reliable traction on both wet and dry surfaces.",
    "Cascadia 17": "The Brooks Cascadia 17 continues its legacy as a trail runner's favourite, designed for stability and ready to tackle the toughest terrains. This latest version offers enhanced all-terrain stability, improved traction, and lightweight DNA LOFT v2 cushioning for a softer, more comfortable ride. With its reliable protection from the elements, the Cascadia 17 is built to keep you comfortable mile after challenging mile, making it the go-to choice for conquering demanding trails.",
    "Divide 4": "Step boldly off the sidewalk and into adventure with the Divide 4 light-trail running shoe. Inspired by road shoes, it boasts an updated mesh for enhanced breathability and a TPU mudguard that shields you from trail obstacles. With trail-ready traction and plush cushioning, its perfect for effortless transitions between roads and trails. Embrace your journey with confidence!",
    "Rincon 4": "Experience lightweight comfort with the Hoka Rincon 4, a lightweight daily trainer built to go the distance. Known for its exceptional cushion-to-weight ratio, the Rincon 4 has been completely revamped to keep you comfortable through even more miles. Upgraded foam offers improved rebound and durability, ensuring that each step feels softer and more responsive than the last. The rubberized EVA outsole design delivers reliable traction without adding extra weight, while the newly enhanced, foot-hugging fit provides the secure comfort you need for every run.",
    "Kawana 2": "The Kawana 2 is Hokas take on a versatile daily trainer that effortlessly transitions from the road to the gym. Featuring a single-layer mesh upper, sock-like bootie, and eye row gillies for enhanced foot lockdown, the Kawana 2 delivers a well-balanced ride. Geared for lateral side-to-side movement, this go-to trainer is equipped with a speckled regrind midsole and a gum rubber outsole, making it perfect for both running and gym sessions.",
    "Bondi 8": "The HOKA Bondi 8 is a go-to choice for those seeking maximum cushioning in a shoe for both running and walking. This version takes comfort to the next level with extra cushioning and updated materials, offering an even softer and lighter step. The newly designed heel and billowed rear crash pad ensure a smooth, comfortable transition from heel to toe.  The Bondi still features a thick slab of EVA cushioning, wide midsole footprint and Hokas signature forefoot rocker technology which reduces the demand on the foot and ankle. The Bondi makes a great choice for those who prioritise comfort and protection during long walks or runs.",
    "Clifton 9": "Introducing the ninth edition of Hokas popular Clifton franchise, now lighter and more cushioned than ever! The new Clifton 9 now features a 3mm increase in stack height and a new responsive foam that delivers an incredibly soft underfoot experience, but retains the familiar rockered ride. Hoka have also reimagined the upper for a sleek, modern look, featuring a plush heel, a reflective heel panel, and a streamlined tongue with a single side medial gusset. Whether you're running errands or racking up miles, the Clifton 9 is here to make your everyday adventures feel effortlessly comfortable.",
    "Clifton 9 GTX": "Introducing the ninth edition of Hokas popular Clifton franchise, now lighter and more cushioned than ever! The new Clifton 9 now features a 3mm increase in stack height and a new responsive foam that delivers an incredibly soft underfoot experience, but retains the familiar rockered ride.  The Clifton 9 GTX features a waterproof membrane to keep your feet dry. Whether you're running errands or racking up miles, the Clifton 9 GTX is here to make your everyday adventures feel effortlessly comfortable.",
    "Arahi 7": "The Arahi 7 is a sleek stability shoe designed to deliver the same streamlined support youve come to expect, now enhanced with our patented J-Frame technology. Hoka have upgraded the Arahi with a zonally engineered, flat knit upper for a snug midfoot fit, while a plusher tongue and stretchy dual gusset under the laces keep everything in place for your most comfortable run yet.",
    "ORA Recovery Slide 3": "Prioritise your recovery with the Hoka Ora Recovery Slide 3, engineered for superior cushioning and support during your downtime. This easy-to-wear slip-on features a forefoot rocker for a smooth, comfortable stride and four air flow channels for enhanced breathability. Sustainably designed with an earth-friendly sugarcane footbed, dual-density geometry, and an injection-moulded outsole, the Ora Recovery Slide 3 combines eco-conscious materials with Hokas renowned comfort. Ideal for unwinding after a long day or intense workout.",
    "Mach 6": "Introducing Hokas lightest and most responsive Mach yet a lively versatile daily trainer designed to cover all run types. With a supercritical foam midsole for extra energy return and strategic rubber on the outsole for added durability, this shoe is built to keep up with you. Hoka have also upgraded to a new creel jacquard upper, offering zonal breathability, internal gusset and a narrower, shallower tapered fit through the forefoot.  Whether youre running a tempo session or wanting a lightweight daily trainer, this is the shoe that will help you get there.",
    "Skyflow": "Get ready to take your daily runs to new heights with the Skyflow. Inspired by Hokas super trainer Skyward X design, this shoe blends cutting-edge geometry with upgraded foam for a next-level experience. The super-cushioned, springy ride comes from Hokas super-critically foamed EVA found in the Mach 6, while the supportive heel-focused Active Foot Frame cradles your foot for comfort. The smooth forefoot rocker profile makes every stride feel effortless. With a sleek upper and durable outsole, the Skyflow is Hokas new take on a daily trainer.",
    "Skyward X": "Introducing the Hoka Skyward X, a super trainer that provides a bouncy soft ride. While most super trainers are versatile for uptempo runs, the Skyward X is geared more toward effortless, cushioned easy day runs. This ultra-cushioned shoe features a groundbreaking suspension system and a unique convex carbon fibre plate, delivering a gentle, spring-like feel with every step. The soft, resilient PEBA foam hugs your feet, while the stable EVA frame ensures smooth, comfortable miles. Get ready for your most relaxed and comfortable run yet with the Skyward X.",
    "Cielo X1": "Experience the streamlined performance of the new Cielo X1. Engineered with speed in mind, we've refined the design to focus on what enhances your ride. With dynamic cutouts for weight savings, this ultra-fast road racer features a winged carbon fibre plate between two layers of responsive PEBA foam. Its speed-oriented rocker shape, breathable knit upper, and secure gusseted knit tongue are designed to keep you race-ready.",
    "Rocket X2": "Introducing the Rocket X 2, designed for runners who love to push their limits. This performance based shoe has been taken to new heights with a keen focus on construction. Hoka has refined the geometry of our propulsive carbon fibre plate, now nestled between two layers of ultra-responsive, high-performance PEBA foam. The upper is crafted from a technical synthetic mesh, giving your feet a snug, comfortable fit, while a sleek gusset and internal midfoot cage provide the secure lockdown you need to race your best.",
    "Mach X": "Hoka Mach X is a plated daily trainer blending elements of race day technology. Imagine the comfort and support of the Mach combined with a dynamic Pebax plate. Thats what you get with the new Mach X. Its a verstalite trainer featuring high-rebound cushioning and a layer of PEBA foam designed for runners wanting a shoe for both long runs and quick pace changes.",
    "Mach X 2": "Introducing the Hoka Mach X 2, the exciting update to Hokas original super trainer. This versatile shoe retains its \"do-it-all\" feel but now leans towards uptempo runs and longer efforts. It features a PEBA top layer midsole, the advanced foam seen in Hokas race day super shoes, for exceptional cushioning and energy return. The extended Pebax Plate enhances the rocker profile, delivering a more aggressive and propulsive ride. With a breathable woven upper, the Mach X 2 blends high performance with a sleek design, making it ideal for dynamic running across various distances.",
    "Bondi SR": "Meet the Bondi SR, the ultimate in cushioned comfort from HOKAs road-shoe lineup, but now tailored for your everyday and work life. Hoka have created a water-resistant leather upper, a slip-resistant outsole, and a plush EVA midsole for all-day cushioning. Whether you're in the service industry or the medical field, this work shoe features an ultra-grippy, full ground contact rubber thats built to handle whatever your day throws at you.",
    "Speedgoat 6": "Meet the Speedgoat 6, your go-to for handling technical terrain. It blends Hokas' trusted cushioning with bold traction and lightweight materials. This updated version features a breathable woven textile upper, a snug internal chassis, a plusher dual gusset tongue, and a lug pattern inspired by a goats hoof. Whether you're tackling tough trails, 5km to the ultra marathon distance or just enjoying a run, the Speedgoat 6 is designed to take you there with ease.",
    "Speedgoat 5": "Meet the Speedgoat 5, your ultimate companion for technical trails. This updated version is lighter and offers more traction than ever. From the outsole to the laces, every detail has been refined, featuring Vibram Megagrip with Traction Lug for a secure grip on loose soil. With the same stack height and rocker profile you love, the Speedgoat 5 now boasts a lighter midsole and durable double-layer jacquard mesh, giving you the confidence to tackle any terrain with ease.",
    "Speedgoat 5 GTX": "Meet the Speedgoat, your ultimate companion for technical trails. This updated version is lighter and offers more traction than ever. From the outsole to the laces, every detail has been refined, including a GTX upper that keeps your feet dry and protected. Featuring Vibram Megagrip with Traction Lug, it provides a secure grip on loose soil. With the same stack height and rocker profile you love, the Speedgoat 5 now boasts a lighter midsole and durable double-layer jacquard mesh, giving you the confidence to tackle any terrain with ease.",
    "Torrent 3": "The Hoka Torrent 3 is a lightweight, nimble trail shoe that offers a more connected ground feel than other models in Hoka's lineup. Featuring a Hoka PROFLY midsole, it delivers a responsive ride with cushioned landings and propulsive toe-offs, perfect for technical terrain. The Torrent 3 also boasts an aggressive multidirectional lugged outsole, providing exceptional grip and traction on a variety of surfaces, so you can tackle any trail with confidence.",
    "Challenger ATR 7": "Introducing the Challenger 7, where the road meets the trail. Hoka have completely redesigned this shoe, featuring a sleek new mesh upper and a soft, plush foam for extra comfort. With a higher stack height and innovative rubber on the outsole, its engineered for a smooth ride across any surface. Inspired by gravel tires, the tread boasts smaller, closely spaced lugs in the centre and larger, more aggressive lugs on the edges for exceptional traction on uneven trail and road terrain.",
    "Stinson 7": "Experience maximum cushioning from city streets to offroad trails. The Stinson 7 is your ultimate all-rounder, offering a perfect mix of plush cushioning and adaptable traction. Ready to tackle any terrain, it handles pavement, trails, and gravel with ease, thanks to its stabilising H-Frame, durable rubber toe cap, and versatile multi-directional lugs.",
    "Mafate Speed 4": "Run faster on the trail with the Hoka Mafate Speed 4. This latest model combines the best features of the classic EVO Mafate and Mafate Speed, now enhanced with Hokas lightest and most responsive two-part PROFLY midsole for a cushioned yet energetic ride. The single-layer jacquard mesh upper ensures an exceptional, breathable fit that holds securely.  Equipped with a Vibram Megagrip outsole featuring Litebase construction and 5mm traction lugs, the Mafate Speed 4 delivers outstanding grip and durability across a variety of mountain terrains whether loose, rocky, hard-packed, gravel, mud, or forested single track. Lightweight, responsive, and protective, the Mafate Speed 4 is designed for trail runners who want to tackle any challenge with confidence and comfort.",
    "Kaha 2 Low GTX": "Meet the Kaha 2 Low GTX, where exceptional cushioning meets outstanding durability. This trail-ready hiking shoe boasts a perfect balance of weight and plushness, thanks to its HUBBLE heel and SwallowTail geometry. Equipped with Vibram Megagrip and Traction Lugs for superior grip, it keeps you steady on any terrain. Plus, it's crafted with care, featuring GORE-TEX fabric made from recycled materials.",
    "Kaha 2 GTX": "Meet the Kaha 2 GTX, where exceptional cushioning meets outstanding durability. This trail-ready hiking shoe boasts a perfect balance of weight and plushness, thanks to its HUBBLE heel and SwallowTail geometry. Equipped with Vibram Megagrip and Traction Lugs for superior grip, it keeps you steady on any terrain. Plus, it's crafted with care, featuring GORE-TEX fabric made from recycled materials.",
    "Anacapa 2 Low GTX": "Anacapa 2 Low GTX is your new go-to hiker, crafted to tread lighter and greener. Featuring recycled yarn meshes, GORE-TEX Invisible Fit technology, a 30% sugarcane EVA midsole, and a Vibram Megagrip outsole, this hiker blends eco-friendliness with high performance. With metal eyelets and an abrasion-resistant toe cap, it's ready to accompany you on any adventure!",
    "Triumph 22": "The Saucony Triumph 22, is crafted to be a workhorse daily trainer. This version features a new midsole - PWRRUN PB (seen in the Endorphin range) has been tuned for daily training and offers a perfect blend of dynamic responsiveness and plush comfort. The broader platform is designed to support more foot types than previous models, while the engineered mesh upper keeps things breathable with a more relaxed fit. Ideal for your daily miles and durable enough for high mileage, the Triumph 22 offers a wonderful mix of comfort and stability to keep you moving with ease.",
    "Triumph 21": "The Triumph 21  your new go-to for everyday runs that demand a bit more. This lightweight and plush performance shoe blends PWRRUN+ cushioning with all-around support to keep you comfortable and secure. It's a neutral runner thats designed to give you just as much energy and support as you put in.",
    "Hurricane 24": "After a long hiatus, the Hurricane series is back and has been redesigned from the ground up to elevate your running experience. Its new generation geometry offers maximal cushioning and protection, featuring a dual-cushioning system with highly responsive PWRRUN PB foam right underfoot for incredible comfort. This is paired with a broad base of PWRRUN foam that gently cradles and stabilises your foot with every step.  The innovative CenterPath Technology, which includes a wider platform, higher sidewalls, an asymmetric profile, and a subtle rocker guides your stride smoothly from impact to toe-off. The adaptive lacing system ensures a snug and secure fit, while full-coverage ground traction and robust durability, the Hurricane 24 is ready to tackle any distance with ease.",
    "Ride 17": "Meet the Saucony Ride 17, your go-to shoe for a workhouse daily trainer. Designed with comfort and durability, its perfect for easy miles and walking. Thanks to the new PWRRUN+ foam midsole, Sauconys most resistant yet youll enjoy premium cushioning with every stride. The engineered mesh upper wraps around your foot, offering all-day comfort, while the updated full coverage outsole gives improved protection and durability underfoot.",
    "Guide 17": "Enhance your running experience with the Saucony Guide 17. These shoes offer dynamic stability to help manage overpronation and feature responsive PWRRUN cushioning for a comfortable ride. The lightweight, breathable mesh upper provides comfort, while the supportive fit and durable outsole ensure reliability. Suitable for runners of all levels, the Saucony Guide 17 combines performance and stability effectively.",
    "Echelon 9": "The Saucony Echelon 9 is crafted for runners and walkers who prioritise support and all-day comfort. With a deroomy toe box and plush PWRRUN cushioning, this shoe offers a stable, balanced ride that's perfect for orthotic wearers or anyone needing a bit more space. The breathable engineered mesh upper keeps your feet cool and comfortable, making the Echelon 9 a popular choice for walkers and runners alike. The Echelon 9 is also a great option for runners/walkers looking for a replacement option for the discontinued Brooks Dyad 11.",
    "Endorphin Elite": "The Saucony Endorphin Elite race shoe is one of the most aggressive, dynamic rides in the super shoe category. The Endorphin Elite is built around a number of key features such as SPEEDROLL technology, which provides a highly rockered ride, a slotted carbon plate that provides superior energy return and PWRRUN HG foam cushioning which is incredibly responsive, maximising energy return.  The upper is crafted from a featherweight, breathable mesh material, to provide a ‘barely there fit on race day. Plus, a low-density layer of rubber on the outsole offers lightweight grip, so you can focus on your performance without extra weight holding you back.  A shoe thats spent four years in development, the Endorphin Elite is Sauconys most energetic race shoe.",
    "Endorphin Pro 4": "Unlock your potential with the Saucony Endorphin Pro 4, your perfect partner for race day. This latest version features a reimagined dual-cushioning system that combines PWRRUN HG and PWRRUN PB foam, delivering unparalleled responsiveness and smooth transitions. Paired with the return of Speedroll technology and a full-length carbon fibre plate, this shoe is designed to maximise efficiency and elevate your performance.  The Endorphin Pro 4 also comes with a redesigned upper system. A lightweight mesh upper, along with an integrated tongue, ensures a secure and consistent fit. Saucony also features their new Super Responsive Sockliner (SRS) which provides incredible bounce with every step.  Refined over multiple generations, the Endorphin Pro 4 offers a stable ride and effortless turnover, making it an excellent choice for those looking to try their first carbon-plated shoe.",
    "Endorphin Speed 4": "The Saucony Endorphin Speed 4 - where speed and versatility meets innovation. The Speed 4 is designed with PWRRUN PB cushioning, giving you responsive energy return for a ride thats both lightweight and responsive. Although engineered predominately for uptempo running, the Speed 4 is versatile enough to double as your go-to daily trainer.  Additional torsional rigidity while maintaining some flexibility at toe-off is achieved with the winged nylon plate, giving you a balance of stability and comfort. Saucony also features their new Super Responsive Sockliner (SRS) which provides added underfoot bounce.  The Endorphin Speed 4 features zonal engineered mesh thats not only breathable but more durable, paired with an integrated tongue for a secure, connected fit. Whether youre gearing up for tempo runs or logging everyday miles, the Endorphin Speed 4 is here to help you reach new speeds and tackle every run with confidence.",
    "Kinvara Pro": "Introducing the Saucony Kinvara Pro, featuring a superfoam and a carbon fibre plate. The dual-cushioning midsole, boasting over 40mm of heel stack, combines durable PWRRUN foam with a layer of ultra-lightweight and bouncy PWRRUN PB foam for a ride thats cushioned and springy. Sitting between these foams is a   length carbon-fibre plate with SPEEDROLL technology, giving you a smooth, rockered ride.  The lightweight outsole is crafted from ground contact EVA, ensuring you stay grounded while moving with ease. The engineered mesh upper wraps your foot in the familiar comfort of the Kinvara, now with added durability and soft padding in the heel collar for those longer runs. Kinvara Pro is perfect for runners who want the performance benefits of a super trainer in a package thats comfortable and adaptable for everyday training.",
    "Kinvara 15": "Step into a traditional feel of speed and comfort with the Saucony Kinvara 15. Crafted for runners who appreciate lightweight performance, this shoe offers responsive PWRRUN cushioning and a sleek, new breathable mesh upper that hugs your foot. Whether you're daily training or running a speed session, the Kinvara 15 delivers a smooth, dynamic ride that lets you glide through every mile.",
    "Kinvara 14": "Step into a traditional feel of speed and comfort with the Saucony Kinvara 14. Crafted for runners who appreciate lightweight performance, this shoe offers responsive PWRRUN cushioning and breathable mesh upper that hugs your foot. Whether you're daily training or running a speed session, the Kinvara 14 delivers a smooth, dynamic ride that lets you glide through every mile.",
    "Xodus Ultra 3": "Saucony XODUS ULTRA 3, your long-haul companion designed for comfort and performance. Tailored specifically for ultra-distance runners, this shoe features a wider platform and supportive sidewall design to keep your foot securely in place, no matter how far you go. The PWRRUN frame in the midsole offers essential support, guiding your foot with every landing and providing a snappy transition as you take off, thanks to its curved shape. The dual midsole setup of PWRRUN+ and PWRUN PB cushioning, is designed to excel in every aspect of impact absorption, energy return, durability, and weight. Plus, the upgraded PWRTRAC outsole gives you the confidence to tackle any terrain.",
    "Xodus Ultra 2": "The Xodus Ultra 2 is built for the long haul, it's the perfect blend of ultra-comfort and ultra-performance, keeping you going strong on every ultra-distance journey.  Experience the light and bouncy PWRRUN PB foam paired with a sturdy PWRRUN Frame, delivering unmatched cushioning and protection every step!",
    "Peregrine 14": "The Saucony Peregrine 14, is all about versatility and performance, combining durability and comfort. With a fit that adapts seamlessly to any terrain, the Peregrine 14 wraps your feet in breathable support thanks to its reinforced upper.  The Peregrin offered a connected to the ground feel with its lower stack height of PWRRUN midsole foam. For an enhanced experience, the PWRRUN+ sockliner assists with superior impact absorption, energy return, and durability all in a lightweight package.  The PWRTRAC outsole, made from tacky, durable rubber that delivers exceptional grip and abrasion resistance on any surface. Whether you're on wet or dry ground, this treaded outsole provides confident grip, shielding you from sharp obstacles along the way.  Whether you're tackling daily training sessions or exploring diverse trails, the Peregrine 14 is the ultimate multi-purpose option, giving runners reliability and performance they need in a single pair.",
    "Peregrine 14 GTX": "The Saucony Peregrine 14 GTX, is all about versatility and performance, combining durability and comfort. With a fit that adapts seamlessly to any terrain, the Peregrine 14 GTX features a waterproof gore-tex upper to keep your feet dry.  The Peregrin offered a connected to the ground feel with its lower stack height of PWRRUN midsole foam. For an enhanced experience, the PWRRUN+ sockliner assists with superior impact absorption, energy return, and durability all in a lightweight package.  The PWRTRAC outsole, made from tacky, durable rubber that delivers exceptional grip and abrasion resistance on any surface. Whether you're on wet or dry ground, this treaded outsole provides confident grip, shielding you from sharp obstacles along the way.  Whether you're tackling daily training sessions or exploring diverse trails, the Peregrine 14 GTX is the ultimate multi-purpose option, giving runners reliability and performance they need in a single pair.",
    "Peregrine 13": "The Saucony Peregrine 13 is all about delivering the ultimate off-road adventure, thanks to its lightweight and cushioned PWRRUN foam midsole. With a tough grip underfoot, a PWRTRAC rubber outsole, and a rock guard, you'll enjoy unbeatable traction and stability on even the most rugged terrain, making your trail runs faster and more exciting.  The Peregrine 13 is your go-to trail workhorse, designed with a lower stack height that keeps you connected to the ground, so you can move fast and feel nimble every step of the way.",
    "Terminal VT": "The Saucony Terminal VT adapts effortlessly to your pace, ready to tackle the middle distance events. The featherlight upper is paired with a PWRRUN HG foam midsole, giving you an extra bounce as you move through each stride. Plus, the PEBAX Spike Plate adds durability and structure without weighing you down. The Terminal is crafted with some recycled materials and is vegan.",
    "Vomero 17": "Enjoy Nikes workhorse daily trainer, the Vomero 17. Designed for your everyday miles, this latest version blends the plush feel of the Invincible with the reliable performance of the Pegasus. Experience enhanced comfort with a dual-density midsole featuring Nikes premium PEBA foam ZoomX on the top layer and more durable Cushlon 3.0 foam on the bottom layer. The new engineered mesh upper offers improved breathability, while the waffle-inspired outsole provides excellent traction and durability, keeping you steady and comfortable from start to finish.",
    "Pegasus 41": "Introducing the Nike Pegasus 41, where the heritage of the classic Pegasus meets modern innovation. This updated edition features a new full-length ReactX midsole thats 13% more responsive and eco-friendly, while maintaining the iconic Pegasus comfort with enhanced performance. With forefoot and heel Air Zoom units for added bounce and an upgraded breathable upper, the Pegasus 41 offers a smooth, flexible ride. Perfect for road running and versatile enough for gym workouts, its the timeless Pegasus reimagined with modern-edge technology.",
    "Pegasus 40": "Introducing the Nike Pegasus 40, where timeless design meets modern performance. This versatile daily trainer features a responsive midsole for a cushioned, energetic ride, while the updated breathable upper ensures a comfortable fit. With durable traction and a sleek design, the Pegasus 40 is ideal for daily runs and versatile enough for various activities. Experience the classic Pegasus heritage redefined for todays runner.",
    "Invincible 3": "Experience Nikes ultimate cushioning and comfort with the Nike Invincible 3. This innovative shoe features a plush, full-length ZoomX foam midsole that delivers exceptional energy return and a soft, bouncy ride. The breathable engineered mesh upper enhances ventilation and support, while the full coverage rubber outsole provides reliable traction. Perfect easy days and long runs, the Invincible 3 combines advanced technology with superior comfort to keep you moving confidently mile after mile.",
    "Infinity Run 4": "Experience elevated comfort on your everyday runs with the updated InfinityRN 4. The new ReactX foam in the midsole offers extra cushioning for a smooth, supportive ride, while the updated Flyknit upper and water-resistant membrane help keep you dry. Enjoy durable traction with the Waffle outsole, designed for reliable grip on the roads. Plus, the ultra-comfortable collar and tongue provide a soft, snug fit, ensuring you stay comfortable mile after mile.",
    "Alphafly 3": "Introducing the latest Alphafly 3  a game-changer designed to revolutionise marathon racing. Engineered for unparalleled speed, this shoe is ready to take you the distance.  Theres three standout technologies in the Alphafly: dual Air Zoom units propel you forward, a full-length carbon fibre plate provides powerful propulsion, and full length heel-to-toe ZoomX foam ensures a silky smooth transition. The soft, stretchy upper supports you from every angle while providing incredible breathability.  Light, fast, and super bouncy, the Alphafly 3 has everything you need for race day. Although tailored to the marathon distance, youll see runners using the Alphafly 3 for all race distances to chase a personal best!",
    "Vaporfly 3": "Unleash your race-day speed with the Nike Vaporfly 3, a shoe line that kick-started the concept of a super shoe. Its designed to tackle races, from the 5K to a marathon. Feel the boost of a full-length carbon plate and Nikes premium PEBA based ZoomX foam working together to deliver an even springier, bouncier ride. The new waffle outsole pattern reduces weight while enhancing traction for a confident stride. Plus, the updated Flyknit upper, with engineered zones and internal heel foam pod, provides a roomier, deeper and more accommodating fit than previous vaporfly.",
    "Zegama 2": "Gear up for trail adventures with the Zegama Trail 2, featuring more ZoomX foam midsole than before, providing exceptional comfort and energy return. The addition of Vibram Megagrip to the outsole has significantly improved traction, especially on mixed and wet terrains. It's a versatile choice for everything from short runs to long training sessions on the trail, offering generous, soft, and responsive cushioning underfoot.",
    "Zegama": "Hit the trail with confidence and enjoy every moment in the Nike ZoomX Zegama. Engineered for unbeatable cushioning and stability on rough terrain, these shoes are your reliable companion for both uphill climbs and downhill descents.  Featuring a secure and flexible engineered mesh upper, the Zegama keeps your feet snug and supported. The higher stack height and lightweight Nike ZoomX midsole provide exceptional cushioning, while the versatile tread design with deep, widely spaced lugs is built to tackle rugged terrain with ease.",
    "Peg trail 5": "The Nike Pegasus Trail 5 is designed to effortlessly bridge the gap between dirt and pavement, and makes a great option for runners seeking a door to trail option.  Nike has enhanced breathability with a mesh upper featuring tighter woven fabric in high-wear areas and open holes for better airflow through the forefoot. Flywire technology integrates with the laces to ensure a secure midfoot hold. The Pegasus Trail 5 is equipped with a ReactX foam midsole thats both cushioned and responsive.  The updated outsole design features less rubber for a seamless transition from road to trail while preserving the full-length ReactX midsole. The durable rubber wraps around the front of the shoe and the generative traction pattern in the forefoot offers extra grip for technical trails, all while maintaining a smooth ride on the road.",
    "Peg trail 4": "The Nike React Pegasus Trail 4 is your go-to shoe for tackling diverse terrains with confidence. Engineered for both road and trail, it offers a smooth, supportive ride with its light yet durable rubber outsole and generative traction pattern for reliable grip on rocky and uneven surfaces. The engineered mesh upper, designed with runner insights, ensures exceptional breathability and a lightweight feel. Laces provide added midfoot support for a secure fit. Whether you're running on dry, moderate terrain or transitioning between road and trail, the Pegasus Trail 4 delivers comfort and versatility for all your adventures.",
    "Maxfly 2": "As seen on the feet of the fastest sprinters in the world, the Maxfly 2 is a go-to for events from the 100 metres to 400 metres, including hurdles. Designed with an Air Zoom unit that meets the precise needs of championship athletes, this shoe has been upgraded to enhance its speed and performance. With improvements to the upper, youll enjoy greater stability and control on every straight and bend as you race towards the finish line.",
    "Victory 2": "Loved by top middle distance athletes around the world, the Nike Victory 2 is a go-to shoe for smashing records from the 800m to the 5000m. This update features a carbon fibre FlyPlate paired with two Air Zoom units, a lightweight responsive ZoomX midsole for unbeatable speed and a four-spike design to make it more stable underfoot.  With AtomKnit on the upper and midfoot containment cables working together with a supportive base, the Victory 2 offers exceptional stability, comfort and control, especially during around track bends. Experience a less aggressive, more comfortable and stable Victory compared to the previous iteration.",
    "Air Victory": "Race toward your personal best with the Nike Air Zoom Victory. Its snappy underfoot bounce propels you forward, whether you're tackling distances from 800 to 5,000 metres. This shoe is designed to be lightweight and breathable, offering a combination of comfort and performance. With features that celebrate your drive to conquer any challenge, the Air Zoom Victory is your ideal companion for pushing your limits.",
    "Dragonfly 2": "Meet the Dragonfly 2, one of the fastest long-distance spikes designed to take your performance to the next level. Engineered for races and key workouts, it combines a comfortable fit with a propulsive feel.  Nike have streamlined the spike configuration to a four-spike design, removed two spikes from the original dragonfly, enhanced the big-toe side platform and heel structure for added support. The updated design also features a slightly wider midfoot and forefoot for improved stability on straightaways and turns.  With a lighter, more responsive full-length plate material, the Dragonfly 2 delivers both durability and a fast feel. The engineered mesh upper boosts breathability and comfort, while the contoured fit offers a seamless sensation designed to keep you going the distance.  Experience exceptional energy return with each stride thanks to the full-length ZoomX foam, Nikes lightest and most resilient energetic foam.",
    "Dragonfly": "Nike ZoomX Dragonfly, designed for everything from 1500m to 10,000m races. Worn by recreational and elite athletes for its unbeatable comfort and speed, the Dragonfly stands out as one of the most dynamic track spikes available. The combination of ZoomX foam and a full-length plate ensures a responsive, energetic and lightweight ride.",
    "Dragonfly XC": "The Dragonfly XC, is a tweaked version of the regular Dragonfly, designed for cross country. ZoomX midsole foam for energy return and a wider base for added stability, its built to keep you confident in any condition.   The lightweight, low-water-retention Vaporweave upper keeps the shoe light even in wet conditions, while the soft, engineered mesh toe box ensures your toes stay comfortable and secure. An added arch band provides a snug fit in muddy conditions and support on uneven terrain, helping you stay grounded no matter the surface. The extra width on the shoes base offers enhanced stability and confidence, giving you the freedom to tackle any terrain with ease.",
    "Rival waffle 6": "The Rival Waffle 6 is your versatile companion for year-round training. With its full-length Waffle traction pattern and a comfortable, accommodating upper, this shoe seamlessly transitions from training sessions to races, making it perfect for young athletes at any level wanting an ‘all rounder spike. Optimise your performance and enjoy every step with the Rival Waffle 6 .",
    "Rival sprint": "Burst out of the starting blocks and sprint to the finish in an entry level spike built for speed. With a strong, reinforced yet lightweight upper, this shoe offers the perfect balance of support and agility to help you power through turns and straightaways on the track. Feel the energy and propulsion from the forefoot plate as you get up on your toes and race toward the finish line with unstoppable momentum.",
    "Rival distance": "Get ready to tackle a wide range of middle- and long-distance events with this adaptable spike. Featuring a lightweight, breathable upper and a cushioned midsole, its designed to keep you comfortable and energised from start to finish. Drawing inspiration from the game-changing Dragonfly spike, the Rival Distance is an entry level spike that delivers efficient energy return to your next track race.",
    "Rival multi": "The Nike Zoom Rival Multi is your entry level spike for training and meet day. With added heel cushioning and a lightweight, durable upper, these spikes are built to help you perform. These are versatile spikes that can cover you for sprints, hurdles, jumps, and pole vault.",
    "Zoom rotational 6": "The Nike Zoom Rotational 6 is expertly designed for shot putters, hammer, and discus throwers, offering a fit thats tailored to your needs. Engineered to minimise internal movement and boost stability, this shoe provides a top-tier competition fit, perfect for executing quick, powerful pivots. Get ready to elevate your performance with a shoe built for precision and speed.",
    "Ja fly 4": "The Nike Ja Fly 4, is a sprint spike designed to help you set personal records from 60 to 400 metres. As Nikes lightest entry level sprint spike, it features a re-engineered plate for increased stiffness and an updated upper for improved breathability. With these enhancements, you can stay focused on pushing your limits and achieving your best.",
    "Mamba 6": "Unleash your powerful finishing kick with the Nike Zoom Mamba 6. As one of Nikes lightest entry level distance spikes, its designed to help you chase down personal records. With a minimal midsole, a revamped upper, and enhanced heel cushioning, this versatile spike is ready to take on anything from the 800 to the 10,000 metre and the water-soaked steeplechase.",
    "LJ Elite": "Get ready to soar with Nikes premium long jumping shoes, designed to help you reach new heights. A Zoom Air unit at the forefoot delivers a light, responsive bounce as your foot connects with the track. Combined with a wider design, carbon-fibre plate, and underfoot flex grooves, these shoes offer a propulsive and stable feel as you take off.  The outsole features 6 spikes and a shockwave pattern crafted from athlete data, providing extra traction where you need it most. A sharkskin heel pattern enhances your hold on multiple surfaces, giving you the confidence to stay secure from take-off to landing.  The adjustable cross strap allows for easy on and off, so you can fine-tune the fit between jumps.  Lightweight woven fabric at the forefoot ensures optimal breathability, while thick, compressive moulded heel foam adds cushioning tailored to long jump athletes. Perforations around the heel help reduce weight and increase ventilation, making these shoes the ultimate companion for your personal best.",
    "Triple jump elite 2": "Experience secure comfort designed for your hops and jumps with the Nike Triple Jump Elite 2. This shoe offers lightweight support through all phases of your triple jump, with a thicker midsole than before for enhanced impact absorption upon landing and dense heel traction provides extra grip when you need it. A full-length carbon plate ensures you stay grounded and stable as you run and jump.  The synthetic and fabric upper keeps your foot snug and contained during your jump, while a perforated heel reduces weight and enhances breathability.",
    "MagMax": "Introducing the Puma MagMax Nitro, Puma's premier max-cushion neutral trainer, crafted for easy days, recovery, and long runs. It features the most NITROFOAM ever used in a Puma shoe, with a large 46mm stack height that delivers unparalleled cushioning and comfort.  The shoe is designed with a really broad midsole surface area and sidewalls that provide inherent stability to a shoe with such a high stack height. Its upper is made from at least 20% recycled materials and includes a soft knitted tongue for a breathable, snug fit. With PUMAGRIP technology renowned for its incredible grip and durability, the MagMax Nitro is perfect for those seeking a smooth, secure ride on any surface.",
    "Magnify Nitro Tech 2": "Experience max cushion comfort with the Magnifty Nitro featuring the thickest layer of NITRO foam in the entire RUN PUMA line-up. NITRO is Pumas innovative nitrogen-infused foam technology, offering lightweight, explosive energy with every stride. Coupled with a durable PUMAGRIP outsole, which provides best-in-class multi-surface traction, this shoe is designed to keep you comfortable and secure on any terrain.  The engineered knit upper and moulded heel collar add thoughtful support exactly where you need it, ensuring a plush, responsive ride. Enjoy the perfect blend of cushioning, traction, and support with every step you take.",
    "ForeverRun Nitro": "Step into a new era of comfort and support with the ForeverRun NITRO. This shoe combines the plush softness of advanced nitrogen-injected NITRO foam with exceptional stability, delivering responsiveness and cushioning in a lightweight daily trainer package. The innovative NITRO midsole features dual densities a softer core surrounded by a firmer rim for an optimal balance of comfort and support. The RUNGUIDE, a firm density guide rail, ensures your foot stays aligned and centred with every stride.  The ForeverRun NITRO also includes PWRTAPE for targeted upper reinforcement, enhancing support and durability.",
    "Velocity Nitro 3": "Introducing the PUMA Velocity NITRO 3, where performance and comfort meets an entry level daily trainer. The Velocity features NITRO technology, offering exceptional responsiveness and cushioning in a light package. The PUMAGRIP outsole provides exceptional traction and durability.",
    "Deviate Nitro Elite 3": "Meet the Deviate NITRO Elite 3, your race-day companion designed for lightweight, powerful propulsion. With 4mm more stack height than the previous iteration, this shoe offers even greater cushioning and bounce. Featuring NITROFOAM Elite cushioning, it delivers a super responsiveness in an incredibly lightweight package. The PWRPLATE, a stiffer carbon fibre plate, stabilises the midsole while maximising energy return for a smooth, efficient run.  Crafted with durable PUMAGRIP rubber, it provides reliable traction across all surfaces. The UltraWEAVE fabric, with its ultra-light, structured, 4-way stretch, reduces weight and friction, making it perfect for athletes aiming to boost speed. Experience Puma performance like never before!",
    "Deviate Nitro 3": "Looking for a shoe that can handle every type of run? The Puma Deviate Nitro 3 is a versatile companion for everyday training runs, tempo sessions, and even race day. With cutting-edge carbon infused PWRPLATE technology and NITRO foam, this shoe delivers a highly responsive and snappy ride, injecting speed into every run.  The Deviate Nitro 3 features NITRO foam, which offers a blend of soft landings and energetic take-offs. Enjoy plush comfort on easy runs and a bouncy, responsive feel when you ramp up the pace for tempo runs.  This shoe pairs perfectly with the Deviate Nitro Elite 3 racing shoes, making it an excellent choice for those looking to experience the benefits of a carbon-plated shoe in a more affordable and durable package.",
    "Fast-R 2": "Meet the FAST-R NITRO ELITE 2, PUMAs race-day shoe, designed to take your performance to the next level. Featuring an NITROFOAM ELITE midsole, this shoe uses innovative nitrogen-infused foam technology to deliver explosive energy return on race day. The extended PWRPLATE, a full-length carbon fibre plate provides maximal propulsion with an extension beyond the toe, boosting your step length and stride with every run.  The ULTRAWEAVE upper ensures a lightweight, secure fit, while PWRTAPE support on the upper keeps you locked in. With PUMAGRIP for multi-surface traction, this shoe is designed to conquer any race distance and weather condition.",
    "Deviate Nitro Elite 2": "Puma Deviate Nitro Elite 2, a more traditional feeling super shoe designed to help you excel across all distances. These lightweight shoes offer top-notch responsiveness, propulsion, and cushioning, making it easier to chase your personal best.  With a lighter nitrogen-injected foam midsole and a stronger carbon fibre plate, the Deviate Nitro Elite 2 combines a thin rubber outsole with a breathable upper for a firmer, more powerful ride and dynamic toe-offs.  You'll love the plush comfort of the Nitro foam and the shoes durability and versatility, perfect for everything from intervals and tempo runs to long distances and marathons. Embrace the blend of classic feel and cutting-edge performance with every stride.",
    "Deviate Nitro 2": "Discover the Puma Deviate Nitro 2, engineered for exceptional comfort and performance. This versatile running shoe features NITRO foam for enhanced responsiveness, a redesigned collar to reduce heel slip, and a lighter, asymmetrical base for a smooth ride. Ideal for various distances, the Deviate Nitro 2 combines maximum cushioning with durability and traction, making it a top choice for any runner seeking both comfort and performance.",
    "Evospeed Distance Nitro Elite": "Experience unmatched propulsion, responsiveness, and speed with Puma evoSPEED mid-distance track spike. Crafted for events from 800m to 10,000m, this shoe is designed to help you reach peak performance. The full-length PWRPLATE carbon fibre plate is engineered to stabilise the midsole while maximising energy return, keeping you efficient with every stride. Paired with NITRO Elite Foam, a premium performance foam, youll experience responsiveness in an ultra-lightweight package. The pebax outsole spike plate, featuring six removable spike pins, ensures superior grip and helps you maintain the high turnover needed to cross the finish line.",
    "Evospeed Sprint Nitro 2": "Unleash your speed with the evoSpeed Sprint Nitro 2. Combining a full-length PEBAX spike plate with NITRO Elite forefoot foam, this shoe delivers unmatched power and propulsion for your 100m and 200m races.  The spoon-shaped carbon fibre plate offers exceptional energy return and torsional rigidity, giving you optimal propulsion right at toe-off. While the ULTRAWEAVE Elite upper is crafted with carbon fibre threads, providing the perfect blend of strength and lightweight performance.",
    "EvoSpeed Tokyo Future 4": "The Tokyo Future 4 is engineered for agility and power, featuring a lightweight and responsive frame. A split carbon fibre plate runs from the midfoot to forefoot, delivering extra propulsion when you need it most. The spike plate boasts eight permanent pins paired with secondary moulded pins for enhanced grip. Plus, the one-piece uppers are crafted with Puma's MATRYX MICRO technology, incorporating carbon threads for a snug and secure fit, so you can stay focused on every stride.",
    "Evospeed Sprint 14": "The PUMA evoSPEED Sprint 14 is the perfect entry-level track spike for sprinters tackling 100 to 400 metres. With its lightweight design and responsive Pebax plate, this spike offers the right balance of speed and comfort for those looking to improve their times. Whether you're new to the track or aiming to set a new personal best, the evoSPEED Sprint 14 is your go-to for reliable performance.",
    "Evospeed Star 8": "The PUMA evoSPEED Star 8 is the perfect entry-level allrounder track spike, designed to excel across a variety of events. Whether you're sprinting the 100m, tackling hurdles, or competing in the high jump, this versatile spike has you covered. With its lightweight design and responsive grip, the evoSPEED Star 8 helps you stay fast and agile from 100m to 10km. Ideal for athletes looking to up their game in multiple disciplines.",
    "Evospeed Distance 11": "The PUMA evoSPEED Distance 11 is the perfect entry-level all-rounder track spike for athletes tackling distances from 800m to 10km. Engineered for versatility, it combines lightweight design with essential support, making it ideal for those just starting to explore middle to long-distance events. Whether you're training or racing, the evoSPEED Distance 11 delivers the comfort and performance you need to go the distance.",
    "Evospeed Prep Sprint 3": "The PUMA Evospeed Prep Sprint 3 is the perfect entry-level allrounder spike, designed for sprinters tackling distances from 100m to 400m. With its lightweight construction and streamlined fit, this spike offers the ideal balance of speed and support, helping you make your mark on the track with confidence.",
    "Cloudboom Strike": "Introducing the latest in On's marathon lineup: the Cloudboom Strike. Designed for peak performance, this innovative racing shoe combines cutting-edge technology with ultra lightweight design to elevate your running experience.  Ons innovation team reimagined the essentials for top-tier performance, even eliminating the strobel fabric to streamline the shoe. Instead, the Cloudboom Strike features a drop-in insole crafted from Helion HF foam, which sits directly atop the carbon plate to elevate the bouncy cushioned ride.  The upper is made from an ultra-light, transparent mesh, offering both a secure fit and a weightless feel. This shoe midsole integrates full length Helion HF hyperfoam, a spoon-shaped carbon-fibre Speedboard to deliver exceptional energy return and smooth transitions.  Perfect for those who love a soft bouncy feel, the Cloudboom Strike helps you seamlessly lock into a faster pace and glide effortlessly through your race events.",
    "Cloudboom Echo 3": "Introducing the On Running Cloudboom Echo 3, your shoe road races from 5k to marathons. This high-performance shoe offers a firmer, more traditional ride, blending a carbon Speedboard plate with an innovative rocker shape and CloudTec and Helion HF foams. Designed to propel you forward with each stride, it helps you push your limits further.  Crafted with breathable microfiber, the upper features silicone inserts on the laces and insole for a secure, comfortable fit. The full-length Speedboard, made from a blend of fibreglass and nylon, delivers a dynamic forward launch. Enjoy the perfect combination of speed, impact protection, and energy return, with a ride thats more subdued than other super shoes on the market.",
    "Cloudmonster Hyper": "Introducing the On Cloudmonster Hyper a super trainer that seamlessly blends versatility with performance. Equipped with Helion HF foam (race day foam from the Cloudboom Strike) in the forefoot and midfoot for a bouncy, energised feel, and Helion super foam in the bottom layer for stability and durability. Whether you're cruising through long runs or picking up the pace, the Cloudmonster Hyper delivers exceptional comfort and agility, making it an ideal ‘do it all shoe for every type of run.",
    "Cloudmonster 2": "The On Cloudmonster 2 is designed to deliver a firmer, stable and responsive ride with its oversized CloudTec pods and Helion superfoam. This updated model features additional stack height and offers a roomier fit through the midfoot and toe box compared to the original Cloudmonster to provide more foot splay for longer runs. The sleek, breathable upper and durable outsole provides reliable performance, making the Cloudmonster 2 ideal for both daily training and long-distance runs. Weve seen many runners go down half a size in the Cloudmonster 2 compared to the original Cloudmonster.",
    "Cloud X 4": "Introducing the On Cloud X 4, the versatile shoe crafted for HIIT sessions, gym workouts, and short-distance running. With its lightweight build and responsive CloudTec cushioning, it offers a dynamic ride that adapts to your movements. The flexible Speedboard provides energy return, while the breathable mesh upper ensures a secure and comfortable fit. Whether you're hitting the gym or tackling a short run, the Cloud X 4 delivers a nice balance of agility and comfort.",
    "Cloud 5": "Meet the On Cloud 5, a shoe for everyday comfort and style. With its lightweight design and signature CloudTec cushioning, this shoe offers a low profile comfortable ride. The sleek, breathable upper provides a snug fit, while the flexible outsole ensures smooth, natural movement. Perfect for both casual wear and light workouts, the Cloud 5 combines versatility with unparalleled comfort.",
    "Cloudsurfer Next": "The On Cloudsurfer Next is designed to elevate your running experience with its advanced CloudTec Phase cushioning. Offering a firmer midsole feel, this shoe provides a smooth rocker and responsive ride. The sleek Speedboard technology enhances your propulsion, while the breathable upper and secure fit ensure comfort and stability. Enjoy a dynamic run with the Cloudsurfer Next's perfect balance of innovation and support.",
    "Cloudflow 4": "Introducing the On Cloudflow 4, a light daily trainer geared for uptempo running. With CloudTec cushioning and a breathable mesh upper, this shoe combines comfort with responsiveness for a dynamic run. The innovative Speedboard technology ensures a smooth, efficient stride, while the updated outsole provides excellent grip and durability. Perfect for both your daily workouts and faster-paced runs, the Cloudflow 4 keeps you feeling light and fast mile after mile.",
    "Cloudflyer 4": "Meet the On Cloudflyer 4, a go to a supportive ride from On. Engineered with On's signature CloudTec cushioning and Helion foam, the Cloudflyer 4 delivers comfort and a smooth, stable run. The innovative design features a wider outsole for enhanced stability and a breathable mesh upper for a cool, secure fit. Ideal for both long runs and daily training, this shoe provides the perfect balance of cushioning and support to keep you moving effortlessly.",
    "Cloudrunner 2": "The upgraded On Running Cloudrunner 2 brings even more support, comfort, and cushioning, making each run and walk a true pleasure. Featuring a Helion superfoam midsole, it delivers softer cushioning and impressive energy return, while CloudTec technology absorbs impact from the road  Perfect for everyday runs and walks, from 5k to 21k, the Cloudrunner 2's new geometry, plush tongue and TPU heel clip offer exceptional security and support.",
    "Cloudsurfer 7": "Introducing the On Cloudsurfer 7, the first shoe to use computer-optimised intelligence and Helion Superfoam to create midsole geometry. As a result of this engineering and the removal of the Speedboard, the Cloudsurfer 7 is an exceptionally soft and lightweight ride.  The Cloudsurfer 7 is designed with the environment in mind. It features no plastic overlays, is crafted from 30% recycled materials, and utilises dope-dye technology for a more sustainable manufacturing process.",
    "Cloudeclipse": "Meet the On Cloudeclipse, the ultimate max-cushion daily trainer that merges the best of the Cloudsurfer and Cloudmonster. This innovative shoe features a double layer of CloudTec Phase, a forefoot rocker and an external Speedboard to provide optimal midfoot rigidity for a smooth, rockered and cushioned ride. Enjoy a roomier forefoot fit, plush cushioning and superior support, making the Cloudeclipse a great easy day training partner.",
    "Cloudstratus 3": "The On Cloudstratus 3, designed for runners who prefer a lower stack height without sacrificing performance. This shoe offers a roomier fit through the toe box, providing extra comfort and flexibility. With its signature CloudTec cushioning and durable outsole, the Cloudstratus 3 delivers a responsive, smooth ride that adapts to your stride. Perfect for those seeking a streamlined, supportive option for their runs.",
    "Cloudultra 2": "Discover the On Cloudultra 2, designed for the ultimate trail adventure. This rugged shoe combines an ultra-cushioned Helion midsole with a durable Missiongrip outsole for exceptional traction and comfort over varied terrains. The Cloudultra 2 features a new secure, breathable upper with reinforced protection to keep your feet safe and comfortable on every journey. Whether you're tackling technical trails or long-distance routes, the Cloudultra 2 provides the support and stability you need to conquer any distance.",
    "Cloudsurfer trail": "Conquer any terrain with the On Cloudsurfer Trail, a versatile road-to-trail hybrid designed for seamless transitions between the two surfaces. Engineered for rugged paths and smooth roads alike, this shoe features a durable, grippy outsole for superior traction and stability. The Helion Superfoam midsole offers a cushioned, responsive ride seen from Ons road shoes, while the CloudTec Phase elements ensure comfort on every step. With a protective upper and reinforced toe cap, the Cloudsurfer Trail keeps your feet secure and ready for any adventure.",
    "Cloudvista": "The On Cloudvista is your go-to shoe for versatile trail adventures. Designed as a road-to-trail hybrid, it combines lightweight agility with durable protection, making it perfect for any terrain. The CloudTec cushioning and Helion superfoam deliver a smooth, comfortable ride, while the Missiongrip outsole provides reliable traction on varied surfaces. Whether you're exploring urban paths or rugged trails, the Cloudvista offers the perfect blend of performance and versatility.",
    "Cloudwander waterproof": "The On Cloudwander Waterproof is geared up for all-weather hiking adventures. Combining the comfort of a running shoe with the durability of a hiking boot, this versatile hybrid features a waterproof membrane to keep your feet dry, CloudTec cushioning for all-day comfort, and a Missiongrip outsole for superior traction on any terrain. Whether you're hitting the trails or exploring the city, the Cloudwander Waterproof is built to keep you moving, no matter the conditions.",
    "Cloudhorizon Waterproof": "Discover the On Cloudhorizon Waterproof hiking shoe, the pinnacle of cushioning and comfort for your adventures. The soft engineered waterproof mesh, crafted from recycled polyester, provides lightweight comfort and flexibility, while the Missiongrip rubber outsole ensures reliable traction. Enhanced with Helion superfoam and CloudTec Phase, this shoe delivers exceptional cushioning and weather protection with its waterproof construction, making it your go-to for any trail, rain or shine.",
    "On Cloudrock 2 Waterproof": "The On Cloudrock 2 Waterproof hiking boot is built for all-day exploring with updated Cloud elements for unmatched comfort. Featuring a new precision hiking fit and a closed midsole channel to keep debris out, this boot is ready for any trail. The improved Missiongrip rubber compound delivers superior grip, while enhanced heel stability provides security on uneven terrain. A TPU toe cap and improved collar fit offer added protection, and the 20% recycled waterproof membrane keeps your feet dry in changeable weather. The Cloudrock 2 is your ultimate companion for rugged adventures.",
    "Cloudspike Citius": "On track spikes have been seen on the feet of some of the world's top athletes, the Cloudspike Citius is an evolution of the Cloudspike 1500m. World Athletics approved and designed for speed, this is On's fastest spike yet for middle distances.  Packed with signature On technology, the Cloudspike Citius features a high-performance Helion HF Pebax hyper foam midsole for explosive energy return. The full-length Speedboard, crafted from a fibreglass-nylon blend, delivers powerful propulsion, while six removable spikes ensure unbeatable traction. The Cloudspike Citius is here to help you run new personal bests on the track.",
    "Cloudspike XC": "The On Cloudspike XC is built for cross-country runners who demand top performance on any terrain. Featuring a rugged rubber outsole with a strategic heel grip pattern, this spike offers exceptional traction and stability for the demands of cross country. The ultralight, one-piece mesh upper ensures breathability and quick water drainage, while the internal cage-like construction provides a secure, supportive fit. Powered by Ons Helion HF hyper foam midsole, the Cloudspike XC delivers explosive energy return to help you tackle the toughest courses with confidence and speed.",
    "Cloudspike 1500m": "The On Cloudspike 1500m is built for mid-distance runners who demand speed and precision on the track. Featuring a responsive fibreglass nylon blended Speedboard and lightweight CloudTec elements, this spike delivers explosive power and smooth transitions with every stride. The breathable, streamlined upper ensures a secure fit, while the aggressive spike plate provides exceptional grip. Designed to help you push your limits, the Cloudspike 1500m is your go-to choice for peak performance in the 1500m.",
    "Cloudspike 10000m": "Introducing the On Cloudspike 10000m, an elite-level distance spike crafted with input from On's Athletics Club athletes. Designed to help you race like a pro, this spike delivers the perfect blend of protection and power to conquer any distance.  At its core, the Cloudspike 10000m features On's Cloudtec technology, with Helion HF, their most responsive and lightweight PEBA foam, paired with a unique full-length Speedboard plate made from a fibreglass-nylon blend. This combination offers an ultra-responsive ride on the track  With a 6-pin spike plate ensuring unbeatable traction, you'll feel confident around the bend.",
    "More v5": "The New Balance Fresh Foam More v5 is the ultimate choice for easy days and recovery jogs. With its enhanced Fresh Foam X midsole, 17% lighter than before, a new stiffer rocker geometry, and a widened platform, this shoe delivers a smooth and stable ride. Think of it as a beefed-up version of the New Balance 1080 v13, offering even more plush cushioning and underfoot protection. The breathable engineered mesh upper ensures a secure fit, while the durable rubber outsole provides reliable traction on various surfaces. Perfect for those seeking maximum cushioning and support for their easy-paced runs.",
    "More v4": "The New Balance Fresh Foam More v4 is designed for a plush, cushioned comfort on every run. Featuring an ultra-soft Fresh Foam X midsole, this shoe delivers a smooth, stable ride that's perfect for long runs, daily training, and recovery days. The breathable mesh upper, and durable rubber outsole, the Fresh Foam More v4 ensures a comfortable, secure fit and reliable traction on road surfaces. For runners who crave maximum cushioning, this shoe is a perfect match.",
    "1080v13": "The New Balance Fresh Foam 1080v13 is a running shoe designed for ultimate comfort and performance. Featuring a plush Fresh Foam X midsole, this shoe delivers a smooth, cushioned ride with some flexibility through the forefoot designed to handle everything from daily runs, recovery days to long runs. The updated engineered mesh upper offers a secure, breathable fit, while the streamlined design ensures lightweight flexibility. Whether you're hitting the pavement or taking it easy, the 1080v13 provides the soft, responsive feel you need to go the distance.",
    "880v14": "The New Balance Fresh Foam 880v14 is a classic daily trainer with a traditional feel, perfect for both running and walking. This iteration features an extra 2mm of Fresh Foam X for enhanced cushioned comfort and a durable outsole that ensures long-lasting performance. Plus, with multiple width options available, the 880v14 offers a fit for every foot, making it an ideal choice for those seeking reliable comfort and support.",
    "880v13": "The New Balance Fresh Foam 880v13 is the perfect blend of classic comfort and modern performance. This traditional daily trainer delivers a reliable, cushioned ride for your everyday runs. With its balanced Fresh Foam X midsole, it provides a smooth, supportive experience whether you're out for a run or taking a long walk. Durable, versatile, and comfort-focused, the 880v13 is also an excellent choice for those looking for a great walking shoe option.",
    "Vongo v6": "The New Balance Fresh Foam X Vongo v6 is designed for runners who want both comfort and stability. Featuring the Fresh Foam X midsole, supportive medial side and an EVA Stability Plate to provide a stable and supportive ride without a traditional medial post. Ideal for daily training and long runs, the Vongo v6 offers a balanced blend of cushioning and stability for a smooth, confident ride.",
    "860v14": "Meet the New Balance Fresh Foam X 860 v14, the stability counterpart to the neutral-based 880v14. Designed for runners and walkers, this shoe combines reliability with stability. The evolved dual-density Fresh Foam X midsole features an extra layer of plush cushioning on top and a firmer bottom layer for a smooth, efficient ride. New EVA technology enhances support, helping to support over-pronation and maintain a natural stride.  The blown rubber outsole offers excellent traction on road conditions without extra weight, while the engineered mesh upper and multiple width options fit a broad range of foot shapes.",
    "860v13": "The New Balance Fresh Foam X 860v13, a blend of stability and comfort. Designed for runners and walkers who value support on every stride, this shoe features Fresh Foam X cushioning for a cushioned, responsive feel, while the TruFuse midsole ensures durability and stability. The sleek, engineered mesh upper offers breathability and a secure fit. With its reliable traction and robust construction, the Fresh Foam X 860v13 is your go-to choice for a supportive running experience.",
    "Fresh Foam X Balos": "Meet New Balances latest release into the Fresh Foam X product line, the Balos. Designed to excel from daily training to workouts, this shoe boasts an innovative midsole by blending PEBA into the Fresh Foam X midsole. A rocker geometry and ground contact EVA outsole ensures a lightweight ride, providing seamless comfort and responsiveness with every stride. New Balance are positioning the Balos as their versalite daily trainer option within their Fresh Foam X family of shoes.",
    "Rebel v4": "Introducing the New Balance FuelCell Rebel v4 a versatile daily trainer. With its PEBA blended midsole and a wider platform than previous models, this shoe provides responsive cushioning and stability. The unplated midsole offers a more flexible, natural feel, while the lightweight, race day-inspired FANTOMFIT upper delivers a snug, breathable fit. Ideal for everyday runs and capable of handling up-tempo sessions, the Rebel v4 combines comfort and performance in one dynamic package.",
    "SC Elite v4": "Discover the New Balance FuelCell Supercomp Elite V4, where innovation meets performance. This iteration features New Balance's first full length PEBA FuelCell midsole, to deliver a gutsier, bouncier ride compared to the Elite v3, with angular midsole geometry to shed excess weight. The lighter yet stiffer Energy Arc carbon plate provides a powerful push-off, enhancing your speed and efficiency.  The FANTOMFIT upper offers a lightweight, breathable feel, making it one of the most comfortable race day uppers available. Designed for both elite and recreational runners, the FuelCell Supercomp Elite V4 is an excellent choice for those new to carbon-plated race shoes or appreciate a wider, more stable platform for race day. The SC Elite v4 combines cutting-edge technology with exceptional comfort for your race experience.",
    "SC Trainer v3": "Introducing the New Balance FuelCell Supercomp Trainer v3 New Balance's take on the super trainer category. This shoe blends the best features of the Supercomp Elite v4 and Rebel v4, offering a dynamic fusion of speed and comfort.  Equipped with the PEBA blended midsole foam from the Rebel v4 and Energy Arc carbon plate from the SC Elite v4, the Supercomp Trainer v3 delivers exceptional responsiveness and energy return, perfect for both tempo workouts and long runs. The FANTOMFIT upper, while retaining the familiar lightweight fit, now includes added structure for enhanced support and durability.  Designed to excel in a variety of training scenarios, the FuelCell Supercomp Trainer v3 is your go-to shoe for pushing the pace and tackling your longest runs with ease.",
    "New Balance FuelCell SuperComp Pacer v2": "The New Balance FuelCell SuperComp Pacer v2 is engineered for speed, making it the perfect choice for 5K to 10K races. Featuring the same full PEBA FuelCell midsole as the SuperComp Elite v4, this shoe delivers explosive energy return in a streamlined, lower-stacked package designed to keep you feeling light and fast.  Ideal for road races, the SuperComp Pacer v2 will also excel on the track, making it an excellent option for handling bends at high speeds during intense track sessions. With its lightweight cushioning, responsive ride, and race-ready fit, this shoe is built to help you achieve your fastest times, whether you're chasing a new personal best or pushing through a tough workout.",
    "More Trail v3":"Discover the New Balance Fresh Foam X More Trail v3, a road-trail hybrid inspired by the More v4. This versatile trail shoe combines plush comfort with stability, making it ideal for a range of terrains. With its soft, cushioned ride and dependable stability on uneven surfaces, its perfect for those new to trail running or those seeking a supportive shoe for easy to long runs on both roads and light to moderate trails. The dual-hardness midsole and aggressive 5mm Vibram lugs offer a nice balance of plush cushioning and confident grip, ensuring a smooth journey on loose or rocky terrain.",
    "Hierro v8": "The New Balance Fresh Foam X Hierro v8, a trail shoe inspired by the popular New Balance 1080v13 road shoe. This versatile trail runner features the signature Fresh Foam X cushioning for plush comfort and a smooth ride on rugged terrain. Equipped with a Vibram Micro-Traction Lug, the Hierro v8 delivers exceptional durability and traction, creating a protective shell around the cushioning. The breathable, lightweight and protective upper ensures a comfortable fit, making it the perfect choice for tackling any trail with confidence and ease.",
    "Hierro v7": "New Balance Fresh Foam X Hierro v7, your ultimate trail companion for rugged adventures. This shoe features a plush Fresh Foam X midsole that provides exceptional cushioning and a smooth ride over challenging terrains. The Vibram outsole offers solid traction and durability, ensuring stability on any surface. A breathable, protective upper shields your feet from debris while providing a secure fit. Perfect for tackling trails with confidence, the Fresh Foam X Hierro v7 combines comfort and performance for every outdoor journey.",
    "Fuelcell Venym": "Meet the New Balance FuelCell Venym, your ultimate trail companion inspired by the road-ready FuelCell Rebel v4. Engineered with FuelCell foam, this shoe offers a propulsive feel that drives you forward with every step, combining minimal weight with maximum traction.  The Hydrohesion rubber outsole ensures reliable grip, even in wet conditions, while Toe Protect technology shields your feet from rocks, roots, and debris. Designed to enhance your trail experience, the FuelCell Venym delivers both speed and protection for your off-road adventures.",
    "SD 100 v5": "The New Balance FuelCell SD100 V5, an entry-level spike designed for sprinters and jumpers. Lightweight and sleek, this spike features a full-length FuelCell midsole that delivers a propulsive feel. The 6-pin TPU spike plate, with removable spikes, provides a responsive yet forgiving grip, making it versatile for a variety of track events. Ideal for athletes ready to enhance their performance, the SD100 V5 combines speed and comfort in a reliable entry-level package.",
    "MD 500 v9": "The New Balance FuelCell MD500 V9, an entry-level spike for aspiring track athletes. Lightweight and sleek, this spike is designed for middle to long-distance races, featuring a full-length FuelCell midsole that offers a propulsive boost to help you race faster. The 6-pin TPU spike plate, with removable spikes, provides a versatile and forgiving grip, ideal for a range of track events. Whether youre gearing up for a personal best or just starting out, the MD500 V9 is a great option.",
    "Slip resistant 515": "The New Balance 515 SR work shoe is your go-to for comfort and style. With its sleek, lightweight design, this shoe keeps you comfortable all day long. Featuring reinforced suede leather, a water-resistant oxford upper, and a slip-resistant rubber outsole, it's built to handle whatever your day throws at you. Plus, its heat-resistant outsole ensures you stay cool on those extra-hot days.",
    "Industrial Speedware": "The New Balance Industrial Speedware equipped with New Balances ACTEVA performance midsole technology and NB Comfort Insert, Speedware offers the perfect blend of support, cushioning, and flexibility. The AT TREAD pattern outsole ensures top-notch slip resistance, keeping you secure in any environment. Designed for the active worker, Speedware performs flawlessly in both indoor and outdoor conditions. Enjoy comfort while you work with additional features like a Kevlar anti-perforation midsole, slip-resistant outsole, composite toe, heel counter support, anti-static properties, airport-friendly design, and a convenient heel pull tab.",
    "Industrial Logic": "The New Balance Industrial Logic combines the comfort of a New Balance running shoe with the essential features of safety footwear. Equipped with the ACTEVA performance midsole and the NB Comfort Insert, it delivers a mix of support, cushioning, and flexibility.  The lightweight rubber outsole ensures durability and flexibility, making it ideal for a range of workplace environments. Additional features include a Kevlar anti-perforation midsole, slip-resistant outsole, composite toe, heel counter support, anti-static properties, and an airport-friendly design.",
    "Industrial Calibre": "The New Balance Calibre, your go-to work boot designed to deliver everything you need for a productive day on the job. Enjoy all-day comfort with the NB comfort insert, while the durable rubber outsole stands up to tough conditions. The premium nubuck leather upper, Ndure abrasion-resistant collar, and Toe Protect feature ensure your feet stay supported and protected from the elements. With Debris Free construction and a handy YKK zipper for easy access, the Calibre is built to be your reliable worksite companion. Experience work boot comfort and support like never before with the New Balance Calibre.",
    "Wave Sky 8": "Meet the Mizuno Wave Sky 8, the neutral daily trainer for runners of all levels who appreciate a soft, stable ride with bouncy cushioning. Whether you're going for easy runs, long distances, or recovery days, this shoe has you covered.  The dual-layer Foam Wave construction combines Mizuno ENERZY NXT and Mizuno ENERZY to deliver a plush, smooth, and stable experience that excels at easier paces.  The new Smooth Stretch Woven upper, made with 70% recycled content, ensures enhanced breathability and adaptability, while the lining and sockliner boast 90% recycled content and the shoelaces are crafted from 90% recycled materials. Plus, it's vegan-friendly, aligning with a commitment to both performance and sustainability.",
    "Wave Sky 7": "The Mizuno Wave Sky 7 is a high mileage neutral running shoe that features Mizunos ENERZY Foam throughout the midsole, delivering a plush yet responsive feel thats perfect for both long runs and easy days. Enhanced by ENERZY CORE for maximum energy return, the Wave Sky 7 provides exceptional comfort and a lively ride.  The revamped outsole with X10 rubber ensures excellent traction and durability for countless miles, while the uppers smooth stretch woven material offers a breathable and soft fit for lasting comfort. Whether youre running or walking, the Mizuno Wave Sky 7 is designed to be your reliable companion, offering the perfect balance of cushioning, responsiveness, and versatility.",
    "Wave Rider 28": "Discover the versatile Mizuno Wave Rider 28, that excels both on the run and walk. This update features a heel wedge of Mizuno's next-generation midsole foam, ENERZY nxt, this shoe offers a softer, smoother landing, while the Mizuno ENERZY midsole through the midfoot and forefoot ensures durability and stability.  The neutral based Wave Rider 28 is now 5mm wider through the midfoot for a more stable transition. While the soft Jacquard Air Mesh upper, provides a seamless fit with notable additional room in the toe box for all-day comfort.",
    "Wave Rider 27": "Meet the Mizuno Wave Rider 27, where comfort meets performance. This latest version features Mizuno's renowned Wave Plate technology for a smooth, cushioned ride that effortlessly absorbs impact and propels you forward. The breathable mesh upper ensures a secure, comfortable fit, while the durable outsole provides excellent traction on various surfaces. Perfect for daily runs or long distances, the Wave Rider 27 offers a balanced blend of support and responsiveness, making it your ideal partner for every run.",
    "Horizon 7": "Mizuno Horizon 7, the most stability focused shoe in the Mizuno lineup. Featuring Foam Wave technology, this shoe provides support without sacrificing softness, thanks to its asymmetrical design and medial rubber wall. The dual-layer Mizuno ENERZY construction soft on top and stable on the bottom ensures a supportive ride.  The Smooth Stretch Woven upper adapts seamlessly to your foot, providing a dynamic and comfortable fit. Elevate your run with the Mizuno Horizon 7, designed for those who demand both support and comfort.",
    "Inspire 20": "The Mizuno Wave Inspire 20 strikes the balance of cushioning, stability, and durability, making it ideal for your daily runs and training. The full-length ENERZY foam midsole delivers plush cushioning and a responsive feel, while the Wave Plate enhances forward transition and stabilises your stride. Designed with moderate guidance-based stability and a high drop, the Wave Inspire 20 is perfect for those seeking dependable support and comfort for everyday running and walking.",
    "Rebellion Pro 2": "The Mizuno Rebellion Pro 2 crafted for experienced runners who strike midfoot or forefoot and prefer an aggressive, propulsive feel.  Featuring a newly reinvented full-length carbon-fibre infused Wave Plate, this shoe delivers a stiffer, more efficient ride. Its sandwiched between layers of bouncy ENERZY LITE+ foam and lightweight ENERZY LITE foam, offering a softer yet more energetic ride compared to its predecessor. Plus, it now fits true to size for an even better fit.  With the G3 rubber outsole, the Rebellion Pro 2 provides one of the best grips available on any super shoe, ensuring you get the performance edge you need on race day.",
    "Rebellion Flash 2": "Meet the Mizuno Wave Rebellion Flash 2, a versatile trainer that brings top-tier technology from the Wave Rebellion Pro 2 to your everyday runs. Designed for speed workouts and tempo sessions, this shoe is designed to elevate your performance with every stride.  Featuring a glass-fibre-infused wave plate, the Wave Rebellion Flash 2 delivers a blend of resilience and subtle flexibility from all angles for a dynamic ride. The Mizuno ENERZY LITE+ and ENERZY midsoles combine to provide a swift, cushioned feel while maintaining stability for your daily training.  Smooth Speed Assist technology and innovative heel-cut rocker geometry ensure optimal turnover, making this shoe adaptable for everything from tempo runs to race-day efforts.",
    "Neo Vista": "Meet the Mizuno Neo Vista, a do it all super trainer designed for exceptional performance and versatility. Geared for long runs and uptempo running in your training block, the Neo Vista can also handle easy and recovery runs. The shoe features a full-length midsole crafted from Mizuno's next-generation eco-friendly MIZUNO ENERZY NXT foam, delivering a soft, bouncy and a feather-light feel underfoot.  The full-length Glass-Fibre infused Wave Plate adds stability and a touch of rigidity to the large stacked midsole, ensuring verstalite performance with every stride. The Neo Vistas soft, adaptable knitted upper with seamless reinforcements wraps your foot securely, while the bootie construction creates a seamless connection between you and the shoe.",
    "Wave Rider TT 2": "The Mizuno Wave Rider TT 2 is built on the trusted Wave Rider 28 midsole setup, delivering the same smooth, responsive ride but with added versatility for trail adventures. This trail-tuned version features a more aggressive outsole for enhanced traction on varied surfaces and a robust upper designed to handle rugged conditions. Whether you're running on the road or exploring off the beaten path, the Wave Rider TT 2 offers a nice blend of comfort, durability, and performance.",
    "Mujin 10": "The Mizuno Wave Mujin 10 is the ultimate trail shoe for runners and hikers who demand maximum cushioning and protection. Ideal for long-distance trail running, hiking, and walking, this shoe combines MIZUNO ENERZY and U4ic technology to deliver an exceptional balance of cushioning, energy return, and durability, perfect for long days on the trails.  The Vibram Megagrip outsole, equipped with 5mm lugs, ensures outstanding traction and durability in both wet and dry conditions, making it a reliable choice for tackling technical terrain with confidence.",
    "Daichi 8": "Tackle trail with confidence in the Mizuno Wave Daichi 8, a high-performance shoe designed for rugged adventures. Built with a full Mizuno ENERZY midsole, this shoe offers a responsive, cushioned ride with dual-density support in the rearfoot for added stability. The Vibram Megagrip outsole enhances traction and durability, ensuring reliable grip on both wet and dry surfaces.  A soft yet durable woven upper wraps your foot securely, providing comfort and stability on challenging terrain. For added protection, the Wave Daichi 8 features a hardened EVA Rock Plate in the forefoot, shielding you from sharp rocks and uneven ground.",
    "Daichi 8 GTX": "Tackle the trails with confidence in the Mizuno Wave Daichi 8, a high-performance shoe designed for rugged adventures. Built with a full Mizuno ENERZY midsole, this shoe offers a responsive, cushioned ride with dual-density support in the rearfoot for added stability. The Vibram Megagrip outsole enhances traction and durability, ensuring reliable grip on both wet and dry surfaces.  A GTX upper adds waterproof protection, keeping your feet dry in wet conditions, while the soft yet durable woven material wraps your foot securely, providing comfort and stability on challenging terrain. For added protection, the Wave Daichi 8 features a hardened EVA Rock Plate in the forefoot, shielding you from sharp rocks and uneven ground.",
    "Wave Rider GTX": "The Mizuno Wave Rider GTX takes the beloved design of the classic Wave Rider and elevates it for all-weather running. Built with the same responsive cushioning and smooth ride as the regular Wave Rider, this version features a GTX upper for waterproof protection, keeping your feet dry in wet conditions. A slightly more aggressive outsole enhances traction, making it ideal for those who need reliable grip on slick or uneven surfaces",
    "X Sprint": "The Mizuno X Sprint track spike is perfect for beginner and intermediate sprinters seeking a responsive ride with a softer plate design. Lightweight and streamlined, it features a flexible carbon fibre plate for a propulsive yet comfortable experience. The removable 7mm spikes provide excellent traction, making it ideal for 100m to 200m distances.",
    "Genesis": "The Salomon Genesis strikes the balance between comfort and performance, giving you the confidence to tackle any trail. Featuring Salomons Energy Foam for plush cushioning and the dynamic support of the Active Chassis, this shoe is ready for the trails. The All-Terrain Contagrip compound, combined with a unique two-part lug pattern and raised tread, ensures a secure grip on even the most unpredictable terrain. The durable, breathable Matryx upper resists trail debris, providing long-lasting protection and comfort.",
    "Thundercross": "The Salomon Thundercross is engineered for dynamic performance on the toughest trails. Built on a stable midsole compound, it delivers a comfortable responsive ride. The aggressive 5mm lugs provide exceptional grip and traction on all types of technical terrain, keeping you confident on any surface. Inspired by Salomon's best trail-running fits, the Thundercross features Sensifit construction, ensuring precise foothold and cushy, reliable comfort for every adventure.",
    "Sense Ride 5": "Meet the Salomon Sense Ride 5, a trail companion for any adventure. Experience the versatile performance and comfort with a blend of lightweight, security, and durability to enhance your run.  With its firm, lower-stack design and updated Energy Foam, the Sense Ride 5 provides a cushioned yet responsive ride, offering stable landings with every stride. The 3D lightweight mesh upper, paired with Salomons quick-lace system, ensures a snug and supportive fit.  The all Terrain Contagrip outsole guarantees excellent traction and durability, giving you confidence on any surface. Experience the versatile performance and comfort of the Salomon Sense Ride 5 and take on your trails with ease.",
    "Speedcross 6": "One of Salomons most iconic shoes, the Speedcross 6 now lighter, more powerful, and grippier than ever. With Mud Contagrip technology and an updated upper, this shoe delivers unbeatable traction and performance on any trail surface.",
    "Glide Max TR": "Discover the GLIDE MAX TR, one of Salomons softest and most cushioned trail shoes. With its higher stack height and Energy Foam, it offers soft smooth cushioning thats perfect for long-distance trail runners who appreciate plush landings. The lightweight engineered mesh upper ensures lasting comfort and breathability, making it an ideal choice for those who value both softness and durability on the trail.",
    "MTL Skyfire 2 Matryx": "Elevate your trail running experience with the Merrell MTL Skyfire 2 Matryx. Designed for athletes, this shoe represents the pinnacle of trail running evolution. The upper features a single-layer Matryx woven textile, reinforced with Kevlar for outstanding durability, breathability, and minimal stretch. Inside, the moisture-wicking lining treatment enhances comfort, while the FloatPro Foam midsole provides exceptional long-distance cushioning. The Vibram MegaGrip outsole, with its 5mm lugs, ensures superior traction on diverse terrains.",
    "Agility Peak 5 GTX": "Elevate your trail running experience with the Merrell Agility Peak 5 GTX, a refined version of one of Merrells most beloved trail shoes. This update brings an enhanced rocker for a smoother ride, a lighter weight for effortless speed, and a sculpted heel cup designed for superior comfort and reduced slip. Whether youre gearing up for an ultra or your next trail 5K, the Agility Peak 5 GTX is your go-to companion for every adventure, with a Gore-Tex exterior ensuring you stay dry and comfortable no matter the conditions.",
    "Trail Glove 7": "The Merrell Trail Glove 7 is a standout in the barefoot category, offering a true minimalist feel with natural foot positioning. Its Vibram EcoStep outsole wraps the foot to maximise grip and connection on varied terrain. The minimal midsole features FloatPro Foam, Merrell's best midsole foam, and incorporates FLEXconnect dual-directional flex-grooves for enhanced ground connection. Ideal for those seeking a closer-to-the-ground experience and superior traction.",
    "Vapor Glove 6": "The Merrell Vapor Glove 6 represents Merrell's most minimal shoe, designed for ultimate lightweight performance in trail running and training. It features a Vibram EcoStep outsole that wraps the foot for maximum grip and connection, while a breathable mesh upper keeps your feet cool. With its minimalist design, the Vapor Glove 6 is perfect for those seeking a close-to-the-ground feel and enhanced agility on the trails.",
    "OOfOS Ooahh Sport - Unisex Recovery Slide": "The OOFOS Ooahh Slide is the ultimate recovery slide for post-sport comfort. Crafted to alleviate stress on the feet, ankles, knees, and lower back, it features exceptional impact absorption and arch support. Built with OOFOAM, the slide absorbs 37% of impact, while its minimalist design ensures a lightweight feel and patented footbed that supports natural motion. Moisture and bacteria-resistant, it is also machine-washable for easy care and long-lasting support.  For sizing: Women should go up half a size if they typically wear a half size, while men should go down half a size for the best fit.",
    "Oofos Ooahh - Womens Recovery Thongs": "The OOFOS Ooahh Womens Recovery Thongs are designed to deliver unparalleled comfort and support for post-activity relaxation. Featuring Oofos' proprietary OOfoam technology, these recovery thongs provide exceptional cushioning and impact absorption, helping to reduce stress on your feet and joints. The ergonomic footbed cradles your arches, promoting a more natural foot movement and recovery. With their sleek, supportive design and superior shock absorption, the Ooahh Thongs are perfect for soothing tired feet and enhancing recovery after your workouts.",
    "OOFOS OOriginal - Unisex Recovery Thongs": "The Oofos OOriginal Unisex Recovery Thongs are designed to offer unparalleled comfort and support after a long day on your feet. Featuring Oofos signature OOfoam technology, these recovery sandals provide superior cushioning and impact absorption to help your feet recover. The contoured footbed and arch support enhance stability and promote natural foot movement, while the sleek design and durable construction ensure lasting wear. Perfect for post-workout or everyday relaxation, the OOriginal Thongs help you feel rejuvenated and comfortable all day long.  Sizes are listed in Men's: M5 - W7, M6 - W8, M7 - W9, M8 - W10, M9 - W11, M10 - W12.",
    "Vectiv Enduris 3": "The North Face Vectiv 3 trail running shoe is the pinnacle of support and comfort in ultra-distance trail running. Designed on an updated D-width last, it accommodates a broad range of foot shapes. The VECTIV Enduris 3 features the advanced VECTIV 2.0 technology with a rockered midsole, forked heel, and forefoot 3D TPU plate for enhanced lateral stability and energy return. Its Surface CTRL rubber outsole with 3.5 mm lugs provides exceptional grip on rugged terrain, while the breathable, protective mesh upper and internal heel support ensure a close, comfortable fit. This shoe offers long-lasting support and comfort, making it perfect for even the most demanding trails.",
    "Vectiv Exploris 2 Futurelight": "Uncover unmatched durability and performance with The North Face Vectiv Exploris 2 Futurelight trail running shoe. This shoe features a breathable-waterproof FUTURELIGHT membrane and an updated D-width last that accommodates a broad range of foot shapes. The VECTIV 2.0 rockered midsole, crafted from premium EVA foam, includes a TPU plate and a forked heel and forefoot for increased stability and long-lasting forward propulsion. Its Surface CTRL rubber outsole, with 4 mm lugs, ensures durability in high-wear areas, making it ready to conquer the toughest terrains.",
    "Vectiv Fastpack Futurelight": "The North Face Vectiv Exploris 2 Futurelight trail running shoe is designed for fast-paced missions, combining a breathable, waterproof FUTURELIGHT membrane with cushioned midsoles and VECTIV technology for exceptional comfort and performance. The abrasion-resistant performance-mesh upper features a gusseted tongue and a protective moulded-TPU toe cap with a no-sew mudguard. Beneath, a single-density 3D TPU plate under the forefoot enhances multi-directional stability, while the rocker midsole geometry promotes long-lasting forward propulsion. The high-rebound, single-density EVA midsole and SurfaceCTRL rubber outsole with 4 mm lugs deliver superior traction and support for rugged terrain.",
    "Altamesa 300": "Elevate your trail running adventures with The North Face Altamesa 300. Perfectly blending lightweight design, stability, and comfort, these shoes are crafted for runners of all levels. The seamless, engineered-mesh upper, made from 53% recycled material, promises breathability and durability, while the generously sized toe box gives you more toe room to spread comfortably.  Enjoy enhanced protection and comfort with the reinforced TPU toe cap, lace guides, and a padded collar that locks in your heel with a touch of plushness. The high-rebound midsole delivers 25 mm of cushy support at the heel, paired with a 6 mm offset and a dynamic stability zone in the forefoot to keep you steady on any trail. SKYCORE rock guards offer light yet flexible protection, and the SURFACE CTRL rubber outsole with 4 mm lugs provides exceptional grip on diverse terrains. With gear-inspired pull-tab webbing for easy entry and a reinforced internal heel counter for added stability, the Altamesa 300 is your perfect partner for exploring everything from gentle trails to rugged mountains.",
    "Primus Lite 3.5": "The Vivobarefoot Primus Lite 3.5 is the most versatile training shoe, designed to support natural movement and strength across a variety of training disciplines. Geared towards both experienced barefoot cross-trainers and those new to barefoot performance, it combines flexibility and durability for a natural feel. Whether you're hitting the gym or exploring new fitness routines, the Primus Lite 3.5 adapts seamlessly to your workout needs, helping you grow strong and move freely.",
    "Primus Knit": "The Vivobarefoot Primus Lite Knit shoes elevate the beloved Primus Lite with a flexible knit upper crafted from recycled plastics, enhancing mobility and agility. Featuring the same 2mm Primus outsole, they offer a natural, responsive feel. Ideal for those seeking a sustainable yet high-performance barefoot footwear experience.",
    "Primus Trail 3.5 FG": "Hit the trail and reconnect with nature in the Vivobarefoot Primus Trail 3.5 FG. This lightweight, durable, and flexible trail-running trainer is designed to bring you closer to the ground, enhancing your natural movement. With its focus on sustainability, the Primus Trail 3.5 FG is also one step closer to being fully recyclable. Embrace your adventure with a shoe that supports both your performance and the planet.",
    "Motus Strength": "Introducing the Vivobarefoot Motus Strength, the first-ever zero-drop barefoot strength-training shoe and a standout in Vivos new performance range. Engineered for natural movement during high-impact workouts, it offers added protection and stability without compromising the true barefoot feel. Designed to help you get strong, enhance durability, and unlock your natural potential, the Motus Strength is your ultimate partner in elevating your fitness journey and extending your healthspan.",
    "Motus Flex": "Step into the Vivobarefoot Motus Flex, our most barefoot-feeling performance trainer yet. Designed for unparalleled flexibility and ground connection, its perfect for callisthenics, primal movement, and bodyweight training. Experience the sensation of being barefoot, even when you cant, and feel every movement and terrain with ease. Embrace natural movement and responsiveness with the Motus Flex, and elevate your training to new heights.",
    "Geo Court": "Discover the perfect blend of style and sensation with the Vivobarefoot Geo Court. This tennis-inspired trainer offers a barefoot experience, featuring sleek design and consciously sourced leather. Embrace a minimalist feel and eco-friendly craftsmanship in every step.",
    "RA": "Discover the Vivobarefoot RA, a dress shoe with a barefoot twist. This casual Oxford combines smart, sophisticated styling on the outside with a barefoot sole on the bottom. Enjoy the best of both worlds elegant enough for any occasion, yet with the natural, flexible feel of a barefoot shoe. The RA brings a touch of wild to your refined look, ensuring comfort and freedom with every step.",
    "Primus Lite IV All Weather": "Brave the elements and feel your power with the Vivobarefoot Primus Lite All Weather. This lightweight, water-resistant barefoot-style trainer is crafted to carry you through the seasons with ease. Designed for a natural, barefoot feel, it ensures comfort and protection whether you're navigating city streets or exploring the outdoors. Embrace every adventure with agility and confidence in the Primus Lite All Weather."
}